[{
  "ID": "AC-2",
  "Name": "Account Management",
  "Class": "Technical",
  "Title": "Account Management",
  "Definition": "(A) The organization identifies and selects the following types of information system accounts to support organizational missions/business functions: [Assignment: organization-defined information system account types]. (B) The organization assigns account managers for information system accounts. (C) The organization establishes conditions for group and role membership. (D) The organization specifies authorized users of the information system, group and role membership, and access authorizations (i.e., privileges) and other attributes (as required) for each account. (E) The organization requires approvals by [Assignment: organization-defined personnel or roles] for requests to create information system accounts. (F) The organization creates, enables, modifies, disables, and removes information system accounts in accordance with [Assignment: organization-defined procedures or conditions]. (G) The organization monitors the use of information system accounts. (H) The organization notifies account managers: (a) When accounts are no longer required; (b) When users are terminated or transferred; and (c) When individual information system usage or need-to-know changes. (I) The organization authorizes access to the information system based on: (a) A valid access authorization; (b) Intended system usage; and (c) Other attributes as required by the organization or associated missions/business functions. (J) The organization reviews accounts for compliance with account management requirements [Assignment: organization-defined frequency]. (K) The organization establishes a process for reissuing shared/group account credentials (if deployed) when individuals are removed from the group.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Information system account types  (E) Personnel or roles (F) Procedures or conditions (J) Frequency",
  "Supplemental Guidance": "Information system account types include, for example, individual, shared, group, system, guest/anonymous, emergency, developer/manufacturer/vendor, temporary, and service. Some of the account management requirements listed above can be implemented by organizational information systems. The identification of authorized users of the information system and the specification of access privileges reflects the requirements in other security controls in the security plan. Users requiring administrative privileges on information system accounts receive additional scrutiny by appropriate organizational personnel (e.g., system owner, mission/business owner, or information technology security co-ordinator) responsible for approving such accounts and privileged access. Organizations may choose to define access privileges or other attributes by account, by type of account, or a combination of both. Other attributes required for authorizing access include, for example, restrictions on time-of-day, day-of-week, and point-of-origin. In defining other account attributes, organizations consider system-related requirements (e.g., scheduled maintenance, system upgrades) and mission/business requirements, (e.g., time zone differences, customer requirements, remote access to support travel requirements). Failure to consider these factors could affect information system availability. Temporary and emergency accounts are accounts intended for short-term use. Organizations establish temporary accounts as a part of normal account activation procedures when there is a need for short-term accounts without the demand for immediacy in account activation. Organizations establish emergency accounts in response to crisis situations and with the need for rapid account activation. Therefore, emergency account activation may bypass normal account authorization processes. Emergency and temporary accounts are not to be confused with infrequently used accounts (e.g., local accounts used for special tasks defined by organizations or when network resources are unavailable). Such accounts remain available and are not subject to automatic disabling or removal dates. Conditions for disabling or deactivating accounts include, for example: (i) when shared/group, emergency, or temporary accounts are no longer required; or (ii) when individuals are transferred or terminated. Some types of information system accounts may require specialized training. Related controls: AC-3, AC-4, AC-5, AC-6, AC-10, AC-17, AC-19, AC-20, AU-9, IA-2, IA-4, IA-5, IA-8, CM-5, CM-6, CM-11, MA-3, MA-4, MA-5, PL-4, SC-13",
  "General Tailoring and Implementation Guidance Notes": "Account review does not need to be a full reconciliation. An incremental (or differential) review from previous review may be sufficient. It is recommended these reviews be performed when physical access list reviews are performed (see PE-2). This security control/enhancement can be addressed by the organization using a combination of automated and procedural controls. The minimization of administrative privileges is an account management best-practice.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-2(1)",
  "Name": "Account Management",
  "Class": "Technical",
  "Title": "Account Management | Automated System Account Management",
  "Definition": "ACCOUNT MANAGEMENT | AUTOMATED SYSTEM ACCOUNT MANAGEMENT The organization employs automated mechanisms to support the management of information system accounts.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "The use of automated mechanisms can include, for example: using email or text messaging to automatically notify account managers when users are terminated or transferred; using the information system to monitor account usage; and using telephonic notification to report atypical system account usage.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement can be met using readily available Commercial-Off-The-Shelf (COTS) components. Consequently, inclusion of this security control/enhancement is strongly encouraged in most cases.",
  "ULL": false,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-3",
  "Name": "Access Enforcement",
  "Class": "Technical",
  "Title": "Access Enforcement",
  "Definition": "(A) The information system enforces approved authorizations for logical access to information and system resources in accordance with applicable access control policies.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Access control policies (e.g., identity-based policies, role-based policies, attribute-based policies) and access enforcement mechanisms (e.g.: access control lists, access control matrices, cryptography) control access between active entities or subjects (i.e., users or processes acting on behalf of users) and passive entities or objects (e.g., devices, files, records, domains) in information systems. In addition to enforcing authorized access at the information system level and recognizing that information systems can host many applications and services in support of organizational missions and business operations, access enforcement mechanisms can also be employed at the application and service level to provide increased information security. Related controls: AC-2, AC-4, AC-5, AC-6, AC-16, AC-17, AC-18, AC-19, AC-20, AC-21, AC-22, AU-9, CM-5, CM-6, CM-11, MA-3, MA-4, MA-5, PE-3",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-4",
  "Name": "Information Flow Enforcement",
  "Class": "Technical",
  "Title": "Information Flow Enforcement",
  "Definition": "(A) The information system enforces approved authorizations for controlling the flow of information within the system and between interconnected systems based on [Assignment: organization-defined information flow control policies]",
  "Extract of all organization-defined parameters (standardized format)": "(A) Information flow control policies",
  "Supplemental Guidance": "Information flow control regulates where information is allowed to travel within an information system and between information systems (as opposed to who is allowed to access the information) and without explicit regard to subsequent accesses to that information. Flow control restrictions include, for example, keeping export-controlled information from being transmitted in the clear to the Internet, blocking outside traffic that claims to be from within the organization, restricting web requests to the Internet that are not from the internal web proxy server, and limiting information transfers between organizations based on data structures and content. Transferring information between information systems representing different security domains with different security policies introduces risk that such transfers violate one or more domain security policies. In such situations, information owners/stewards provide guidance at designated policy enforcement points between interconnected systems. Organizations should consider mandating specific architectural solutions when required to enforce specific security policies. Enforcement includes, for example: (i) prohibiting information transfers between interconnected systems (i.e., allowing access only); (ii) employing hardware mechanisms to enforce one-way information flows; and (iii) implementing trustworthy re-grading mechanisms to reassign security attributes and security labels. Organizations commonly employ information flow control policies and enforcement mechanisms to control the flow of information between designated sources and destinations (e.g., networks, individuals, and devices) within information systems and between interconnected systems. Flow control is based on the characteristics of the information and/or the information path. Enforcement occurs, for example, in boundary protection devices (e.g., gateways, routers, guards, encrypted tunnels, firewalls) that employ rule sets or establish configuration settings that restrict information system services, provide a packet-filtering capability based on header information, or message-filtering capability based on message content (e.g., implementing key word searches or using document characteristics). Organizations also consider the trustworthiness of filtering/inspection mechanisms (i.e., hardware, firmware, and software components) that are critical to information flow enforcement. Control enhancements 3 through 22 primarily address cross-domain solution needs which focus on more advanced filtering techniques, in-depth analysis, and stronger flow enforcement mechanisms implemented in cross-domain products, for example, high-assurance guards. Such capabilities are generally not available in commercial off-the-shelf information technology products. Related controls: AC-3, AC-17, AC-19, AC-21, CM-6, CM-7, SA-8, SC-2, SC-5, SC-7, SC-18.",
  "General Tailoring and Implementation Guidance Notes": "Examples of devices that can perform information flow enforcement include firewalls, gateways and virtual private networks. Example technologies that implement this control are the Sender Policy Framework (SPF) that can be used to help protect organizations from spoofed email attacks, web content filtering devices that help protect organizations from malicious web traffic and deny users' access to unauthorized web sites, and Data Loss Prevention products.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-5",
  "Name": "Separation of Duties",
  "Class": "Technical",
  "Title": "Separation of Duties",
  "Definition": "(A) The organization: (a) Separates [Assignment: organization-defined duties of individuals]; (b) Documents separation of duties of individuals; and (c) Defines information system access authorizations to support separation of duties.",
  "Extract of all organization-defined parameters (standardized format)": "(A)(a) Duties of individuals",
  "Supplemental Guidance": "Separation of duties addresses the potential for abuse of authorized privileges and helps to reduce the risk of malevolent activity without collusion. Separation of duties includes, for example: (i) dividing mission functions and information system support functions among different individuals and/or roles; (ii) conducting information system support functions with different individuals (e.g., system management, programming, configuration management, quality assurance and testing, and network security); and (iii) ensuring security personnel administering access control functions do not also administer audit functions. Related controls: AC-3, AC-6, PE-3, PE-4, PS-2",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-6",
  "Name": "Least Privilege",
  "Class": "Technical",
  "Title": "Least Privilege",
  "Definition": "(A) The organization employs the principle of least privilege, allowing only authorized accesses for users (or processes acting on behalf of users) which are necessary to accomplish assigned tasks in accordance with organizational missions and business functions.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizations employ least privilege for specific duties and information systems. The principle of least privilege is also applied to information system processes, ensuring that the processes operate at privilege levels no higher than necessary to accomplish required organizational missions/business functions. Organizations consider the creation of additional processes, roles, and information system accounts as necessary, to achieve least privilege. Organizations also apply least privilege to the development, implementation, and operation of organizational information systems. Related controls: AC-2, AC-3, AC-5, CM-6, CM-7, PL-2",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-6(5)",
  "Name": "Least Privilege",
  "Class": "Technical",
  "Title": "Least Privilege | Privileged Accounts",
  "Definition": "LEAST PRIVILEGE | PRIVILEGED ACCOUNTS The organization restricts privileged accounts on the information system to [Assignment: organization-defined personnel or roles].",
  "Extract of all organization-defined parameters (standardized format)": "Personnel or roles",
  "Supplemental Guidance": "Privileged accounts, including super user accounts, are typically described as system administrators for various types of commercial off-the-shelf operating systems. Restricting privileged accounts to specific personnel or roles prevents day-to-day users from having access to privileged information/functions. Organizations may differentiate in the application of this control enhancement between allowed privileges for local accounts and for domain accounts provided organizations retain the ability to control information system configurations for key security parameters and as otherwise necessary to sufficiently mitigate risk. Related control: CM-6.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": false,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-6(10)",
  "Name": "Least Privilege",
  "Class": "Technical",
  "Title": "Least Privilege | Prohibit Non-Privileged Users from Executing Privileged Functions",
  "Definition": "LEAST PRIVILEGE | PROHIBIT NON-PRIVILEGED USERS FROM EXECUTING PRIVILEGED FUNCTIONS The information system prevents non-privileged users from executing privileged functions to include disabling, circumventing, or altering implemented security safeguards/countermeasures.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Privileged functions include, for example, establishing information system accounts, performing system integrity checks, or administering cryptographic key management activities. Non-privileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "AC-7",
  "Name": "Unsuccessful Login Attempts",
  "Class": "Technical",
  "Title": "Unsuccessful Logon Attempts",
  "Definition": "(A) The information system enforces a limit of [Assignment: organization-defined number] consecutive invalid logon attempts by a user during a [Assignment: organization-defined time period]. (B) The information system automatically [Selection: locks the account/node for an [Assignment: organization-defined time period]; locks the account/node until released by an administrator; delays next logon prompt according to [Assignment: organization-defined delay algorithm]] when the maximum number of unsuccessful attempts is exceeded.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Number (A) Time period (B) Selection: locks the account/node for an [Assignment: organization-defined time period]; locks the account/node until released by an administrator; delays next logon prompt according to [Assignment: organization-defined delay algorithm]  (B) Time period (if selected) (B) Delay algorithm (if selected)",
  "Supplemental Guidance": "Due to the potential for denial of service, automatic lockouts initiated by the information system are usually temporary and automatically release after a predetermined time period established by the organization. If a delay algorithm is selected, the organization may choose to employ different algorithms for different information system components based on the capabilities of those components. Response to unsuccessful login attempts may be implemented at both the operating system and the application levels. This control applies to all accesses other than those accesses explicitly identified and documented by the organization in AC-14",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement requires careful balance between usability and security. Care needs to be taken to ensure that the appropriate balance between the two seemingly conflicting requirements is achieved. If possible, an increasing time-out period should be used to deter determined attackers. For example, an original time-out of 5 minutes can become 10 minutes after the next 3 unsuccessful attempts, then 20 minutes, then 40 minutes, etc.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-8",
  "Name": "System Use Notification",
  "Class": "Technical",
  "Title": "System Use Notification",
  "Definition": "(A) The information system displays to users [Assignment: organization-defined system use notification message or banner] before granting access to the system that provides privacy and security notices in accordance with the TBS Policy on the Use of Electronic Networks [Reference 5]. (B) The information system retains the notification message or banner on the screen until users acknowledge the usage conditions and take explicit actions to log on to or further access the information system. (C) The information system for publicly accessible systems: (a) Displays system use information [Assignment: organization-defined conditions], before granting further access; (b) Displays references, if any, to monitoring, recording, or auditing that are consistent with privacy accommodations for such systems that generally prohibit those activities; and (c) Includes a description of the authorized uses of the system.",
  "Extract of all organization-defined parameters (standardized format)": "(A) System use notification or message or banner (C)(a) Conditions",
  "Supplemental Guidance": "System use notifications can be implemented using messages or warning banners displayed before individuals log in to information systems. System use notifications are used only for access via logon interfaces with human users and are not required when such human interfaces do not exist. Organizations consider system use notification messages/banners displayed in multiple languages based on specific organizational needs and the demographics of information system users. Organizations also consult with the Departmental Legal Services Branch for legal review and approval of warning banner content",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-9",
  "Name": "Previous Logon (Access) Notification",
  "Class": "Technical",
  "Title": "Previous Logon (Access) Notification",
  "Definition": "(A) The information system notifies the user, upon successful logon (access) to the system, of the date and time of the last logon (access).",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "This control is applicable to logons to information systems via human user interfaces and logons to systems that occur in other types of architectures (e.g., service-oriented architectures). Related controls: AC-7, PL-4",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases. This security control/enhancement should be implemented where possible and practical. Some COTS operating systems may not support this capability.",
  "ULL": false,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-12",
  "Name": "Session Termination",
  "Class": "Technical",
  "Title": "Session Termination",
  "Definition": "(A) The information system automatically terminates a user session after [Assignment: organization-defined conditions or trigger events requiring session disconnect].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Conditions or trigger events",
  "Supplemental Guidance": "This control addresses the termination of user-initiated logical sessions in contrast to SC-10 which addresses the termination of network connections that are associated with communications sessions (i.e., network disconnect). A logical session (for local, network, and remote access) is initiated whenever a user (or process acting on behalf of a user) accesses an organizational information system. Such user sessions can be terminated (and thus terminate user access) without terminating network sessions. Session termination terminates all processes associated with a user’s logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated. Conditions or trigger events requiring automatic session termination can include, for example, organization-defined periods of user inactivity, targeted responses to certain types of incidents, time-of-day restrictions on information system use. Related controls: SC-10, SC-23",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "AC-19",
  "Name": "Access Control for Mobile Devices",
  "Class": "Technical",
  "Title": "Access Control for Mobile Devices",
  "Definition": "(A) The organization establishes usage restrictions, configuration requirements, connection requirements, and implementation guidance for organization-controlled mobile devices. (B) The organization authorizes the connection of mobile devices to organizational information systems.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "A mobile device is a computing device that: (i) has a small form factor such that it can easily be carried by a single individual; (ii) is designed to operate without a physical connection (e.g., wirelessly transmit or receive information); (iii) possesses local, non-removable or removable data storage; and (iv) includes a self-contained power source. Mobile devices may also include voice communication capabilities, on-board sensors that allow the device to capture information, and/or built-in features for synchronizing local data with remote locations. Examples include smart phones, E-readers, and tablets. Mobile devices are typically associated with a single individual and the device is usually in close proximity to the individual; however, the degree of proximity can vary depending upon on the form factor and size of the device. The processing, storage, and transmission capability of the mobile device may be comparable to or merely a subset of desktop systems, depending upon the nature and intended purpose of the device. Due to the large variety of mobile devices with different technical characteristics and capabilities, organizational restrictions may vary for the different classes/types of such devices. Usage restrictions and specific implementation guidance for mobile devices include, for example, configuration management, device identification and authentication, implementation of mandatory protective software (e.g., malicious code detection, firewall), scanning devices for malicious code, updating virus protection software, scanning for critical software updates and patches, conducting primary operating system (and possibly other resident software) integrity checks, and disabling unnecessary hardware (e.g., wireless, infrared). Organizations are cautioned that the need to provide adequate security for mobile devices goes beyond the requirements in this control. Many safeguards and countermeasures for mobile devices are reflected in other security controls in the catalog allocated in the initial control baselines as starting points for the development of security plans and overlays using the tailoring process. There may also be some degree of overlap in the requirements articulated by the security controls within the different families of controls. AC-20 addresses mobile devices that are not organization-controlled. Related controls: AC-3, AC-7, AC-18, AC-20, CA-9, CM-2, IA-2, IA-3, MP-2, MP-4, MP-5, PL-4, SC-7, SC-43, SI-3, SI-4",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AC-20(3)",
  "Name": "Use of External Information Systems",
  "Class": "Technical",
  "Title": "Use of External Information Systems | Non-Organizationally Owned Systems / Components / Devices",
  "Definition": "USE OF EXTERNAL INFORMATION SYSTEMS | NON-ORGANIZATIONALLY OWNED SYSTEMS / COMPONENTS / DEVICES The organization [Selection: restricts; prohibits] the use of non-organizationally owned information systems, system components, or devices to process, store, or transmit organizational information.",
  "Extract of all organization-defined parameters (standardized format)": "Selection: restricts; prohibits",
  "Supplemental Guidance": "Non-organizationally owned devices include devices owned by other organizations (e.g., non-GC organizations, contractors) and personally owned devices. There are risks to using non-organizationally owned devices. In some cases, the risk is sufficiently high as to prohibit such use. In other cases, it may be such that the use of non-organizationally owned devices is allowed but restricted in some way. Restrictions include, for example: (i) requiring the implementation of organization-approved security controls prior to authorizing such connections; (ii) limiting access to certain types of information, services, or applications; (iii) using virtualization techniques to limit processing and storage activities to servers or other system components provisioned by the organization; and (iv) agreeing to terms and conditions for usage. For personally owned devices, organizations should consult with Departmental Legal Services regarding legal issues associated with using such devices in operational environments, including, for example, requirements for conducting forensic analyses during investigations after an incident.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "AC-22",
  "Name": "Publicly Accessible Content",
  "Class": "Technical",
  "Title": "Publicly Accessible Content",
  "Definition": "(A) The organization designates individuals authorized to post information onto a publicly accessible information system. (B) The organization trains authorized individuals to ensure that publicly accessible information does not contain confidentially sensitive information. (C) The organization reviews the proposed content of information prior to posting onto the publicly accessible information system to ensure that confidentially sensitive information is not included. (D) The organization reviews the content on the publicly accessible information system for confidentially sensitive information [Assignment: organization-defined frequency] and removes such information, if discovered.",
  "Extract of all organization-defined parameters (standardized format)": "(D) Frequency",
  "Supplemental Guidance": "In accordance with GC legislation and TBS policies, directives and standards, the general public is not authorized access to confidentially sensitive information (e.g., information protected under the Privacy Act and proprietary information). This control addresses information systems that are controlled by the organization and accessible to the general public, typically without identification or authentication. The posting of information on non-organization information systems is covered by organizational policy. Related controls: AC-3, AC-4, AT-2, AT-3, AU-13",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is applicable to the organization as opposed to a specific information system.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-2",
  "Name": "Auditable Events",
  "Class": "Technical",
  "Title": "Audit Events",
  "Definition": "(A) The organization determines that the information system is capable of auditing the following events: [Assignment: organization-defined auditable events]. (B) The organization coordinates the security audit function with other organizational entities requiring audit-related information to enhance mutual support and to help guide the selection of auditable events. (C) The organization provides a rationale for why the auditable events are deemed to be adequate to support after-the-fact investigations of security incidents. (D) The organization determines that the following events are to be audited within the information system: [Assignment: organization-defined audited events (the subset of the auditable events defined in AU-2 a.) along with the frequency of (or situation requiring) auditing for each identified event].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Auditable events (D) Audited events (the subset of auditable events defined in AU-2(a)) along with the frequency of (or situation requiring) auditing",
  "Supplemental Guidance": "An event is any observable occurrence in an organizational information system. Organizations identify audit events as those events which are significant and relevant to the security of information systems and the environments in which those systems operate in order to meet specific and ongoing audit needs. Audit events can include, for example, password changes, failed logons, or failed accesses related to information systems, administrative privilege usage, PIV credential usage, or third-party credential usage. In determining the set of auditable events, organizations consider the auditing appropriate for each of the security controls to be implemented. To balance auditing requirements with other information system needs, this control also requires identifying that subset of auditable events that are audited at a given point in time. For example, organizations may determine that information systems must have the capability to log every file access both successful and unsuccessful, but not activate that capability except for specific circumstances due to the potential burden on system performance. Auditing requirements, including the need for auditable events, may be referenced in other security controls and control enhancements. Organizations also include auditable events that are required by applicable GC legislation and TBS policies, directives, and standards. Audit records can be generated at various levels of abstraction, including at the packet level as information traverses the network. Selecting the appropriate level of abstraction is a critical aspect of an audit capability and can facilitate the identification of root causes to problems. Organizations consider in the definition of auditable events, the auditing necessary to cover related events such as the steps in distributed, transaction-based processes (e.g., processes that are distributed across multiple organizations) and actions that occur in service-oriented architectures. Related controls: AC-6, AC-17, AU-3, AU-12, MA-4, MP-2, MP-4, SI-4",
  "General Tailoring and Implementation Guidance Notes": "The information system audits the following privileged user/process events at a minimum: (a) Successful and unsuccessful attempts to access, modify, or delete security objects (Security objects include audit data, system configuration files and file or users’ formal access permissions.) (b) Successful and unsuccessful logon attempts (c) Privileged activities or other system level access (see notes for AU-2 (4)) (d) Starting and ending time for user access to the system (e) Concurrent logons from different workstations (f) All program initiations (see notes for AU-2 (4)) In addition, the information system audits the following unprivileged user/process events at a minimum: (a) Successful and unsuccessful attempts to access, modify, or delete security objects (b) Successful and unsuccessful logon attempts (c) Starting and ending time for user access to the system (d) Concurrent logons from different workstations",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-3",
  "Name": "Content of Audit Records",
  "Class": "Technical",
  "Title": "Content of Audit Records",
  "Definition": "(A) The information system generates audit records containing information that establishes what type of event occurred, when the event occurred, where the event occurred, the source of the event, the outcome of the event, and the identity of any individuals or subjects associated with the event.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Audit record content that may be necessary to satisfy the requirement of this control, includes, for example, time stamps, source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked. Event outcomes can include indicators of event success or failure and event-specific results (e.g., the security state of the information system after the event occurred). Related controls: AU-2, AU-8, AU-12, SI-11",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-6",
  "Name": "Audit Review, Analysis, and Reporting",
  "Class": "Technical",
  "Title": "Audit Review, Analysis, and Reporting",
  "Definition": "(A) The organization reviews and analyzes information system audit records [Assignment: organization-defined frequency] for indications of [Assignment: organization-defined inappropriate or unusual activity]. (B) The organization reports findings to [Assignment: organization-defined personnel or roles].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Frequency (A) Inappropriate or unusual activity (B) Personnel or roles",
  "Supplemental Guidance": "Audit review, analysis, and reporting covers information security-related auditing performed by organizations including, for example, auditing that results from monitoring of account usage, remote access, wireless connectivity, mobile device connection, configuration settings, system component inventory, use of maintenance tools and nonlocal maintenance, physical access, temperature and humidity, equipment delivery and removal, communications at the information system boundaries, use of mobile code, and use of VoIP. Findings can be reported to organizational entities that include, for example, incident response team, help desk, information security group/department. If organizations are prohibited from reviewing and analyzing audit information or unable to conduct such activities (e.g., in certain national security applications or systems), the review/analysis may be carried out by other organizations granted such authority. Related controls: AC-2, AC-3, AC-6, AC-17, AT-3, AU-7, AU-16, CA-7, CM-5, CM-10, CM-11, IA-3, IA-5, IR-5, IR-6, MA-4, MP-4, PE-3, PE-6, PE-14, PE-16, RA-5, SC-7, SC-18, SC-19, SI-3, SI-4, SI-7",
  "General Tailoring and Implementation Guidance Notes": "In order for audit to be effective, audit logs need to be collected from the various systems, amalgamated centrally and analyzed regularly by an automated tool. This approach ensures that audit logs are scrutinized and that coordinated attacks can be identified. Although an automated capability is preferable, this security control can be met using manual processes.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-8",
  "Name": "Time Stamps",
  "Class": "Technical",
  "Title": "Time Stamps",
  "Definition": "(A) The information system uses internal system clocks to generate time stamps for audit records. (B) The information system records time stamps for audit records that can be mapped to Coordinated Universal Time (UTC) or Greenwich Mean Time (GMT) and meets [Assignment: organization-defined granularity of time measurement].",
  "Extract of all organization-defined parameters (standardized format)": "(B) Granularity of time measurement",
  "Supplemental Guidance": "Time stamps generated by the information system include date and time. Time is commonly expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC. Granularity of time measurements refers to the degree of synchronization between information system clocks and reference clocks, for example, clocks synchronizing within hundreds of milliseconds or within tens of milliseconds. Organizations may define different time granularities for different system components. Time service can also be critical to other security capabilities such as access control and identification and authentication, depending on the nature of the mechanisms used to support those capabilities. Related controls: AU-3, AU-12",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-9",
  "Name": "Protection of Audit Information",
  "Class": "Technical",
  "Title": "Protection of Audit Information",
  "Definition": "(A) The information system protects audit information and audit tools from unauthorized access, modification, and deletion.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Audit information includes all information (e.g., audit records, audit settings, and audit reports) needed to successfully audit information system activity. This control focuses on technical protection of audit information. Physical protection of audit information is addressed by media protection controls and physical and environmental protection controls. Related controls: AC-3, AC-6, MP-2, MP-4, PE-2, PE-3, PE-6",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-9(4)",
  "Name": "Protection of Audit Information",
  "Class": "Technical",
  "Title": "Protection of Audit Information | Access by Subset of Privileged Users",
  "Definition": "PROTECTION OF AUDIT INFORMATION | ACCESS BY SUBSET OF PRIVILEGED USERS The organization authorizes access to management of audit functionality to only [Assignment: organization-defined subset of privileged users].",
  "Extract of all organization-defined parameters (standardized format)": "Subset of privileged users",
  "Supplemental Guidance": "Individuals with privileged access to an information system and who are also the subject of an audit by that system, may affect the reliability of audit information by inhibiting audit activities or modifying audit records. This control enhancement requires that privileged access be further defined between audit-related privileges and other privileges, thus limiting the users with audit-related privileges. Related control: AC-5.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "AU-12",
  "Name": "Audit Generation",
  "Class": "Technical",
  "Title": "Audit Generation",
  "Definition": "(A) The information system provides audit record generation capability for the auditable events defined in AU-2 a. at [Assignment: organization-defined information system components]. (B) The information system allows [Assignment: organization-defined personnel or roles] to select which auditable events are to be audited by specific components of the information system. (C) The information system generates audit records for the events defined in AU-2 d. with the content defined in AU-3.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Information system components (B) Personnel or roles",
  "Supplemental Guidance": "Audit records can be generated from many different information system components. The list of audited events is the set of events for which audits are to be generated. These events are typically a subset of all events for which the information system is capable of generating audit records. Related controls: AC-3, AU-2, AU-3, AU-6, AU-7",
  "General Tailoring and Implementation Guidance Notes": "In order to facilitate audit review and analysis, audit records should be time correlated and provided in a common format. Time correlation can be achieved by synchronizing the clocks of the systems generating the audit events.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CA-5",
  "Name": "Plan of Action and Milestones",
  "Class": "Management",
  "Title": "Plan of Action and Milestones",
  "Definition": "(A) The organization develops a plan of action and milestones for the information system to document the organization’s planned remedial actions to correct weaknesses or deficiencies noted during the assessment of the security controls and to reduce or eliminate known vulnerabilities in the system; and (B) The organization updates existing plan of action and milestones [Assignment: organization-defined frequency] based on the findings from security controls assessments, security impact analyses, and continuous monitoring activities.",
  "Extract of all organization-defined parameters (standardized format)": "(B) Frequency",
  "Supplemental Guidance": "Plans of action and milestones are key sections of the operations security plan, which is are key documents in the security authorization packages and may be subject to organizational and GC reporting. Related controls: CA-2, CA-7, CM-4.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CA-8",
  "Name": "Penetration Testing",
  "Class": "Management",
  "Title": "Penetration Testing",
  "Definition": "(A) The organization conducts penetration testing [Assignment: organization-defined frequency] on [Assignment: organization-defined information systems or system components].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Frequency (A) Information systems or components",
  "Supplemental Guidance": "Penetration testing is a specialized type of assessment conducted on information systems or individual system components to identify vulnerabilities that could be exploited by adversaries. Such testing can be used to either validate vulnerabilities or determine the degree of resistance organizational information systems have to adversaries within a set of specified constraints (e.g., time, resources, and/or skills). Penetration testing attempts to duplicate the actions of adversaries in carrying out hostile cyber-attacks against organizations and provides a more in-depth analysis of security-related weaknesses/deficiencies. Organizations can also use the results of vulnerability analyses to support penetration testing activities. Penetration testing can be conducted on the hardware, software, or firmware components of an information system and can exercise both physical and technical security controls. A standard method for penetration testing includes, for example: (i) pretest analysis based on full knowledge of the target system; (ii) pretest identification of potential vulnerabilities based on pretest analysis; and (iii) testing designed to determine exploitability of identified vulnerabilities. All parties agree to the rules of engagement before the commencement of penetration testing scenarios. Organizations correlate the penetration testing rules of engagement with the tools, techniques, and procedures that are anticipated to be employed by adversaries carrying out attacks. Organizational risk assessments guide decisions on the level of independence required for personnel conducting penetration testing. Related control: SA-12",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "CM-2",
  "Name": "Baseline Configuration",
  "Class": "Operational",
  "Title": "Baseline Configuration",
  "Definition": "(A) The organization develops, documents, and maintains under configuration control, a current baseline configuration of the information system.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "This control establishes baseline configurations for information systems and system components including communications and connectivity-related aspects of systems. Baseline configurations are documented, formally reviewed and agreed-upon sets of specifications for information systems or configuration items within those systems. Baseline configurations serve as a basis for future builds, releases, and/or changes to information systems. Baseline configurations include information about information system components (e.g., standard software packages installed on workstations, notebook computers, servers, network components, or mobile devices; current version numbers and patch information on operating systems and applications; and configuration settings/parameters), network topology, and the logical placement of those components within the system architecture. Maintaining baseline configurations requires creating new baselines as organizational information systems change over time. Baseline configurations of information systems reflect the current enterprise architecture. Related controls: CM-3, CM-6, CM-8, CM-9, SA-10.",
  "General Tailoring and Implementation Guidance Notes": "A baseline configuration should include all current patches for the operating system and applications installed. The baseline should also deactivate all unused ports, services and software and use an hardened configuration (e.g., guest accounts deactivated, access control to all system files and directories applied, default passwords changed)",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-3",
  "Name": "Configuration Change Control",
  "Class": "Operational",
  "Title": "Configuration Change Control",
  "Definition": "(A) The organization determines the types of changes to the information system that are configuration-controlled. (B) The organization reviews proposed configuration-controlled changes to the information system and approves or disapproves such changes with explicit consideration for security impact analyses. (C) The organization documents configuration change decisions associated with the information system. (D) The organization implements approved configuration-controlled changes to the information system. (E) The organization retains records of configuration-controlled changes to the information system for [Assignment: organization-defined time period]. (F) The organization audits and reviews activities associated with configuration-controlled changes to the information system. (G) The organization coordinates and provides oversight for configuration change control activities through [Assignment: organization-defined configuration change control element (e.g., committee, board)] that convenes [Selection (one or more): [Assignment: organization-defined frequency]; [Assignment: organization-defined configuration change conditions]].",
  "Extract of all organization-defined parameters (standardized format)": "(E) Time period  (G) Configuration change control element (e.g. committee, board)  (G) Selection (one or more): [Assignment: organization-defined frequency]; [Assignment: organization-defined configuration change conditions] (G) Frequency (if selected) (G) Configuration change conditions (if selected)",
  "Supplemental Guidance": "Configuration change controls for organizational information systems involve the systematic proposal, justification, implementation, testing, review, and disposition of changes to the systems, including system upgrades and modifications. Configuration change control includes changes to baseline configurations for components and configuration items of information systems, changes to configuration settings for information technology products (e.g., operating systems, applications, firewalls, routers, and mobile devices), unscheduled/unauthorized changes, and changes to remediate vulnerabilities. Typical processes for managing configuration changes to information systems include, for example, Configuration Control Boards that approve proposed changes to systems. For new development information systems or systems undergoing major upgrades, organizations consider including representatives from development organizations on the Configuration Control Boards. Auditing of changes includes activities before and after changes are made to organizational information systems and the auditing activities required to implement such changes. Related controls: CA-7, CM-2, CM-4, CM-5, CM-6, CM-9, SA-10, SI-2, SI-12",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-4",
  "Name": "Security Impact Analysis",
  "Class": "Operational",
  "Title": "Security Impact Analysis",
  "Definition": "(A) The organization analyzes changes to the information system to determine potential security impacts prior to change implementation.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizational personnel with information security responsibilities (e.g., Information System Administrators, Information System Security Officers, Information System Security Managers, and Information System Security Engineers) conduct security impact analyses. Individuals conducting security impact analyses possess the necessary skills/technical expertise to analyze the changes to information systems and the associated security ramifications. Security impact analysis may include, for example, reviewing security plans to understand security control requirements and reviewing system design documentation to understand control implementation and how specific changes might affect the controls. Security impact analyses may also include assessments of risk to better understand the impact of the changes and to determine if additional security controls are required. Security impact analyses are scaled in accordance with the security categories of the information systems. Related controls: CA-2, CA-7, CM-3, CM-9, SA-4, SA-5, SA-10, SI-2",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-5",
  "Name": "Access Restrictions for Change",
  "Class": "Operational",
  "Title": "Access Restrictions for Change",
  "Definition": "(A) The organization defines, documents, approves, and enforces physical and logical access restrictions associated with changes to the information system.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Any changes to the hardware, software, and/or firmware components of information systems can potentially have significant effects on the overall security of the systems. Therefore, organizations permit only qualified and authorized individuals to access information systems for purposes of initiating changes, including upgrades and modifications. Organizations maintain records of access to ensure that configuration change control is implemented and to support after-the-fact actions should organizations discover any unauthorized changes. Access restrictions for change also include software libraries. Access restrictions include, for example, physical and logical access controls (see AC-3 and PE-3), workflow automation, media libraries, abstract layers (e.g., changes implemented into third-party interfaces rather than directly into information systems), and change windows (e.g., changes occur only during specified times, making unauthorized changes easy to discover). Related controls: AC-3, AC-6, PE-3",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-6",
  "Name": "Configuration Settings",
  "Class": "Operational",
  "Title": "Configuration Settings",
  "Definition": "(A) The organization establishes and documents configuration settings for information technology products employed within the information system using [Assignment: organization-defined security configuration checklists] that reflect the most restrictive mode consistent with operational requirements. (B) The organization implements the configuration settings. (C) The organization identifies, documents, and approves any deviations from established configuration settings for [Assignment: organization-defined information system components] based on [Assignment: organization-defined operational requirements]. (D) The organization monitors and controls changes to the configuration settings in accordance with organizational policies and procedures.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Security configuration checklists  (C) Information system components (C) Operational requirements",
  "Supplemental Guidance": "Configuration settings are the set of parameters that can be changed in hardware, software, or firmware components of the information system that affect the security posture and/or functionality of the system. Information technology products for which security-related configuration settings can be defined include, for example, mainframe computers, servers (e.g., database, electronic mail, authentication, web, proxy, file, domain name), workstations, input/output devices (e.g., scanners, copiers, and printers), network components (e.g., firewalls, routers, gateways, voice and data switches, wireless access points, network appliances, sensors), operating systems, middleware, and applications. Security-related parameters are those parameters impacting the security state of information systems including the parameters required to satisfy other security control requirements. Security-related parameters include, for example: (i) registry settings; (ii) account, file, directory permission settings; and (iii) settings for functions, ports, protocols, services, and remote connections. Organizations establish organization-wide configuration settings and subsequently derive specific settings for information systems. The established settings become part of the systems configuration baseline. Common secure configurations (also referred to as security configuration checklists, lockdown and hardening guides, security reference guides, security technical implementation guides (STIG)) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for specific information technology platforms/products and instructions for configuring those information system components to meet operational requirements. Common secure configurations can be developed by a variety of organizations including, for example, information technology product developers, manufacturers, vendors, consortia, academia, industry, federal government organizations, and others in the public and private sectors. The Security Content Automation Protocol (SCAP) and the defined standards within the protocol (e.g., Common Configuration Enumeration) provide an effective method to uniquely identify, track, and control configuration settings. Related controls: AC-19, CM-2, CM-3, CM-7, SI-4.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases. Such best practices include disabling unrequired operating system functionality, application security configuration hardening, and randomizing local administrator passwords.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-7",
  "Name": "Least Functionality",
  "Class": "Operational",
  "Title": "Least Functionality",
  "Definition": "(A) The organization configures the information system to provide only essential capabilities. (B) The organization prohibits or restricts the use of the following functions, ports, protocols, and/or services: [Assignment: organization-defined prohibited or restricted functions, ports, protocols, and/or services].",
  "Extract of all organization-defined parameters (standardized format)": "(B) Prohibited or restricted functions, ports, protocols, and/or services",
  "Supplemental Guidance": "Information systems can provide a wide variety of functions and services. Some of the functions and services, provided by default, may not be necessary to support essential organizational operations (e.g., key missions, functions). Additionally, it is sometimes convenient to provide multiple services from single information system components, but doing so increases risk over limiting the services provided by any one component. Where feasible, organizations limit component functionality to a single function per device (e.g., email servers or web servers, but not both). Organizations review functions and services provided by information systems or individual components of information systems, to determine which functions and services are candidates for elimination (e.g., Voice over Internet Protocol (VoIP), Instant Messaging, auto-execute, and file sharing). Organizations consider disabling unused or unnecessary physical and logical ports/protocols (e.g., USB, FTP, IPv6, HTTP) on information systems to prevent unauthorized connection of devices, unauthorized transfer of information, or unauthorized tunnelling. Organizations can utilize network scanning tools, intrusion detection and prevention systems, and end-point protections such as firewalls and host-based intrusion detection systems to identify and prevent the use of prohibited functions, ports, protocols, and services. Related controls: AC-6, CM-2, RA-5, SA-5, SC-7",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-8",
  "Name": "Information System Component Inventory",
  "Class": "Operational",
  "Title": "Information System Component Inventory",
  "Definition": "(A) The organization develops and documents an inventory of information system components that accurately reflects the current information system. (B) The organization develops and documents an inventory of information system components that includes all components within the authorization boundary of the information system. (C) The organization develops and documents an inventory of information system components that is at the level of granularity deemed necessary for tracking and reporting. (D) The organization develops and documents an inventory of information system components that includes [Assignment: organization-defined information deemed necessary to achieve effective information system component accountability]. (E) The organization reviews and updates the information system component inventory [Assignment: organization-defined frequency].",
  "Extract of all organization-defined parameters (standardized format)": "(D) Information deemed necessary to achieve effective information system component accountability (E) Frequency",
  "Supplemental Guidance": "Organizations may choose to implement centralized information system component inventories that include components from all organizational information systems. In such situations, organizations ensure that the resulting inventories include system-specific information required for proper component accountability (e.g., information system association, information system owner). Information deemed necessary for effective accountability of information system components includes, for example, hardware inventory specifications, software license information, software version numbers, component owners, and for networked components or devices, machine names and network addresses. Inventory specifications include, for example, manufacturer, device type, model, serial number, and physical location. Related controls: CM-2, CM-6.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CM-9",
  "Name": "Configuration Management Plan",
  "Class": "Operational",
  "Title": "Configuration Management Plan",
  "Definition": "(A) The organization develops, documents, and implements a configuration management plan for the information system that addresses roles, responsibilities, and configuration management processes and procedures. (B) The organization develops, documents, and implements a configuration management plan for the information system that establishes a process for identifying configuration items throughout the system development life cycle and for managing the configuration of the configuration items. (C) The organization develops, documents, and implements a configuration management plan for the information system that defines the configuration items for the information system and places the configuration items under configuration management; and (D) The organization develops, documents, and implements a configuration management plan for the information system that protects the configuration management plan from unauthorized disclosure and modification.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Configuration management plans satisfy the requirements in configuration management policies while being tailored to individual information systems. Such plans define detailed processes and procedures for how configuration management is used to support system development life cycle activities at the information system level. Configuration management plans are typically developed during the development/acquisition phase of the system development life cycle. The plans describe how to move changes through change management processes, how to update configuration settings and baselines, how to maintain information system component inventories, how to control development, test, and operational environments, and how to develop, release, and update key documents. Organizations can employ templates to help ensure consistent and timely development and implementation of configuration management plans. Such templates can represent a master configuration management plan for the organization at large with subsets of the plan implemented on a system by system basis. Configuration management approval processes include designation of key management stakeholders responsible for reviewing and approving proposed changes to information systems, and personnel that conduct security impact analyses prior to the implementation of changes to the systems. Configuration items are the information system items (hardware, software, firmware, and documentation) to be configuration-managed. As information systems continue through the system development life cycle, new configuration items may be identified and some existing configuration items may no longer need to be under configuration control. Related controls: CM-2, CM-3, CM-4, CM-5, CM-8, SA-10",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CP-2",
  "Name": "Contingency Plan",
  "Class": "Operational",
  "Title": "Contingency Plan",
  "Definition": "(A) The organization develops a contingency plan for the information system that: (a) Identifies essential missions and business functions and associated contingency requirements; (b) Provides recovery objectives, restoration priorities, and metrics; (c) Addresses contingency roles, responsibilities, and assigned individuals with contact information; (d) Addresses maintaining essential missions and business functions despite an information system disruption, compromise, or failure; (e) Addresses eventual, full information system restoration without deterioration of the security safeguards originally planned and implemented; and (f) Is reviewed and approved by [Assignment: organization-defined personnel or roles]. (B) The organization distributes copies of the contingency plan to [Assignment: organization-defined key contingency personnel (identified by name and/or by role) and organizational elements]. (C) The organization coordinates contingency planning activities with incident handling activities. (D) The organization reviews the contingency plan for the information system [Assignment: organization-defined frequency]. (E) The organization updates the contingency plan to address changes to the organization, information system, or environment of operation and problems encountered during contingency plan implementation, execution, or testing. (F) The organization communicates contingency plan changes to [Assignment: organization-defined key contingency personnel (identified by name and/or by role) and organizational elements]. (G) The organization protects the contingency plan from unauthorized disclosure and modification.",
  "Extract of all organization-defined parameters (standardized format)": "(A)(f) Personnel or roles (B) Key contingency personnel (identified by name and/or by role) (D) Frequency (F) Key contingency personnel (identified by name and/or by role)",
  "Supplemental Guidance": "Contingency planning for information systems is part of an overall organizational program for achieving continuity of operations for mission/business functions. Contingency planning addresses both information system restoration and implementation of alternative mission/business processes when systems are compromised. The effectiveness of contingency planning is maximized by considering such planning throughout the phases of the system development life cycle. Performing contingency planning on hardware, software, and firmware development can be an effective means of achieving information system resiliency. Contingency plans reflect the degree of restoration required for organizational information systems since not all systems may need to fully recover to achieve the level of continuity of operations desired. Information system recovery objectives reflect applicable GC legislation and TBS policies, directives and standards. In addition to information system availability, contingency plans also address other security-related events resulting in a reduction in mission and/or business effectiveness, such as malicious attacks compromising the confidentiality or integrity of information systems. Actions addressed in contingency plans include, for example, orderly/graceful degradation, information system shutdown, fallback to a manual mode, alternate information flows, and operating in modes reserved for when systems are under attack. By closely coordinating contingency planning with incident handling activities, organizations can ensure that the necessary contingency planning activities are in place and activated in the event of a security incident. Related controls: AC-14, CP-6, CP-7, CP-8, CP-9, CP-10, IR-4, IR-8, MP-2, MP-4, MP-5.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CP-4",
  "Name": "Contingency Plan Testing and Exercises",
  "Class": "Operational",
  "Title": "Contingency Plan Testing",
  "Definition": "(A) The organization tests the contingency plan for the information system [Assignment: organization-defined frequency] using [Assignment: organization-defined tests] to determine the effectiveness of the plan and the organizational readiness to execute the plan. (B) The organization reviews the contingency plan test results. (C) The organization initiates corrective actions, if needed.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Frequency (A) Tests",
  "Supplemental Guidance": "Methods for testing contingency plans to determine the effectiveness of the plans and to identify potential weaknesses in the plans include, for example, walk-through and tabletop exercises, checklists, simulations (parallel, full interrupt), and comprehensive exercises. Organizations conduct testing based on the continuity requirements in contingency plans and include a determination of the effects on organizational operations, assets, and individuals arising due to contingency operations. Organizations have flexibility and discretion in the breadth, depth, and timelines of corrective actions. Related controls: CP-2, CP-3, IR-3",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "CP-9",
  "Name": "Information System Backup",
  "Class": "Operational",
  "Title": "Information System Backup",
  "Definition": "(A) The organization conducts backups of user-level information contained in the information system [Assignment: organization-defined frequency consistent with recovery time and recovery point objectives]. (B) The organization conducts backups of system-level information contained in the information system [Assignment: organization-defined frequency consistent with recovery time and recovery point objectives]. (C) The organization conducts backups of information system documentation including security-related documentation [Assignment: organization-defined frequency consistent with recovery time and recovery point objectives]. (D) The organization protects the confidentiality, integrity, and availability of backup information at storage locations. (AA) The organization determines retention periods for essential business information and archived backups.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Frequency consistent with recovery time and recovery point objectives (B) Frequency consistent with recovery time and recovery point objectives (C) Frequency consistent with recovery time and recovery point objectives",
  "Supplemental Guidance": "System-level information includes, for example, system-state information, operating system and application software, and licenses. User-level information includes any information other than system-level information. Mechanisms employed by organizations to protect the integrity of information system backups include, for example, digital signatures and cryptographic hashes. Protection of system backup information while in transit is beyond the scope of this control. Information system backups reflect the requirements in contingency plans as well as other organizational requirements for backing up information. Related controls: CP-2, CP-6, MP-4, MP-5, SC-13",
  "General Tailoring and Implementation Guidance Notes": "Incremental daily backups and full weekly backups can be performed.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CP-10",
  "Name": "Information System Recovery and Reconstitution",
  "Class": "Operational",
  "Title": "Information System Recovery and Reconstitution",
  "Definition": "(A) The organization provides for the recovery and reconstitution of the information system to a known state after a disruption, compromise, or failure.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Recovery is executing information system contingency plan activities to restore organizational missions/business functions. Reconstitution takes place following recovery and includes activities for returning organizational information systems to fully operational states. Recovery and reconstitution operations reflect mission and business priorities, recovery point/time and reconstitution objectives, and established organizational metrics consistent with contingency plan requirements. Reconstitution includes the deactivation of any interim information system capabilities that may have been needed during recovery operations. Reconstitution also includes assessments of fully restored information system capabilities, reestablishment of continuous monitoring activities, potential information system reauthorizations, and activities to prepare the systems against future disruptions, compromises, or failures. Recovery/reconstitution capabilities employed by organizations can include both automated mechanisms and manual procedures. Related controls: CA-2, CA-6, CA-7, CP-2, CP-4, CP-6, CP-7, CP-9, SC-24",
  "General Tailoring and Implementation Guidance Notes": "Rather than re-building systems from scratch this control enhancement ensures that organizations re-build systems from either a secure image or baseline. This approach will improve the effectiveness of the recovery process.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "CP-10(2)",
  "Name": "Information System Recovery and Reconstitution",
  "Class": "Operational",
  "Title": "Information System Recovery and Reconstitution | Transaction Recovery",
  "Definition": "INFORMATION SYSTEM RECOVERY AND RECONSTITUTION | TRANSACTION RECOVERY The information system implements transaction recovery for systems that are transaction-based.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Transaction-based information systems include, for example, database management systems and transaction processing systems. Mechanisms supporting transaction recovery include, for example, transaction rollback and transaction journaling.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement should be addressed where applicable and if practical to do so.",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "IA-2",
  "Name": "Identification and Authentication (Organizational Users)",
  "Class": "Technical",
  "Title": "Identification and Authentication (Organizational Users)",
  "Definition": "(A) The information system uniquely identifies and authenticates organizational users (or processes acting on behalf of organizational users).",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizational users include employees or individuals that organizations deem to have equivalent status of employees (e.g., contractors, guest researchers). This control applies to all accesses other than: (i) accesses that are explicitly identified and documented in AC-14; and (ii) accesses that occur through authorized use of group authenticators without individual authentication. Organizations may require unique identification of individuals in group accounts (e.g., shared privilege accounts) or for detailed accountability of individual activity. Organizations employ passwords, tokens, or biometrics to authenticate user identities, or in the case of multifactor authentication, or some combination thereof. Access to organizational information systems is defined as either local access or network access. Local access is any access to organizational information systems by users (or processes acting on behalf of users) where such access is obtained by direct connections without the use of networks. Network access is access to organizational information systems by users (or processes acting on behalf of users) where such access is obtained through network connections (i.e., nonlocal accesses). Remote access is a type of network access that involves communication through external networks (e.g., the Internet). Internal networks include local area networks and wide area networks. In addition, the use of encrypted VPNs for network connections between organization-controlled endpoints and non-organization controlled endpoints may be treated as internal networks from the perspective of protecting the confidentiality and integrity of information traversing the network. Multifactor authentication requires the use of two or more different factors to achieve authentication. The factors are defined as: (i) something you know (e.g., password, personal identification number [PIN]); (ii) something you have (e.g., cryptographic identification device, token); or (iii) something you are (e.g., biometric). Multifactor solutions that require devices separate from information systems gaining access include, for example, hardware tokens providing time-based or challenge-response authenticators and identity smart cards. In addition to identifying and authenticating users at the information system level (i.e., at logon), organizations also employ identification and authentication mechanisms at the application level, when necessary, to provide increased information security. Identification and authentication requirements for other than organizational users are described in IA-8. Related controls: AC-2, AC-3, AC-14, AC-17, AC-18, IA-4, IA-5, IA-8.",
  "General Tailoring and Implementation Guidance Notes": "The implementation of this security control/enhancement should be determined based on a Threat and Risk Assessment (TRA). Multifactor authentication can be addressed using a software-based certificate in conjunction with a username and password. Network access is not the same as remote access.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-2(1)",
  "Name": "Identification and Authentication (Organizational Users)",
  "Class": "Technical",
  "Title": "Identification and Authentication (Organizational Users) | Network Access to Privileged Accounts",
  "Definition": "IDENTIFICATION AND AUTHENTICATION | NETWORK ACCESS TO PRIVILEGED ACCOUNTS The information system implements multifactor authentication for network access to privileged accounts.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Related control: AC-6.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "IA-2(2)",
  "Name": "Identification and Authentication (Organizational Users)",
  "Class": "Technical",
  "Title": "Identification and Authentication (Organizational Users) | Network Access to Non-Privileged Accounts",
  "Definition": "IDENTIFICATION AND AUTHENTICATION | NETWORK ACCESS TO NON-PRIVILEGED ACCOUNTS The information system implements multifactor authentication for network access to non-privileged accounts.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "IA-2(11)",
  "Name": "Identification and Authentication (Organizational Users)",
  "Class": "Technical",
  "Title": "Identification and Authentication (Organizational Users) | Remote Access - Separate Device",
  "Definition": "IDENTIFICATION AND AUTHENTICATION | REMOTE ACCESS - SEPARATE DEVICE The information system implements multifactor authentication for remote access to privileged and non-privileged accounts such that one of the factors is provided by a device separate from the system being accessed and the device meets [Assignment: organization-defined strength of mechanism requirements].",
  "Extract of all organization-defined parameters (standardized format)": "Strength of mechanism requirements",
  "Supplemental Guidance": "For remote access to privileged/non-privileged accounts, the purpose of requiring a device that is separate from the information system being accessed as one of the factors during multifactor authentication is to reduce the likelihood of compromising authentication credentials stored on the system. For example, adversaries deploying malicious code on organizational information systems can potentially compromise such credentials resident on the system and subsequently impersonate authorized users. Related control: AC-6.",
  "General Tailoring and Implementation Guidance Notes": "Depending on robustness requirements, multifactor authentication can be addressed using a software-based certificate in conjunction with a username and password or hardware cryptographic tokens. For additional guidance please refer to ITSG-31 User Authentication Guidance for IT Systems.",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "IA-4",
  "Name": "Identifier Management",
  "Class": "Technical",
  "Title": "Identifier Management",
  "Definition": "(A) The organization manages information system identifiers by receiving authorization from [Assignment: organization-defined personnel or roles] to assign an individual, group, role, or device identifier. (B) The organization manages information system identifiers by selecting an identifier that identifies an individual, group, role, or device. (C) The organization manages information system identifiers by assigning the identifier to the intended individual, group, role, or device. (D) The organization manages information system identifiers by preventing reuse of identifiers for [Assignment: organization-defined time period]. (E) The organization manages information system identifiers by disabling the identifier after [Assignment: organization-defined time period of inactivity].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Personnel or roles (D) Time period (E) Time period of inactivity",
  "Supplemental Guidance": "Common device identifiers include, for example, MAC, IP addresses, or device-unique token identifiers. Management of individual identifiers is not applicable to shared information system accounts (e.g., guest and anonymous accounts). Typically, individual identifiers are the user names of the information system accounts assigned to those individuals. In such instances, the account management activities of AC-2 use account names provided by IA-4. This control also addresses individual identifiers not necessarily associated with information system accounts (e.g., identifiers used in physical security control databases accessed by badge reader systems for access to information systems). Preventing reuse of identifiers implies preventing the assignment of previously used individual, group, role, or device identifiers to different individuals, groups, roles, or devices. Related controls: AC-2, IA-2, IA-3, IA-5, IA-8, SC-37",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-5",
  "Name": "Authenticator Management",
  "Class": "Technical",
  "Title": "Authenticator Management",
  "Definition": "(A) The organization manages information system authenticators by verifying, as part of the initial authenticator distribution, the identity of the individual, group, role, or device receiving the authenticator. (B) The organization manages information system authenticators by establishing initial authenticator content for authenticators defined by the organization. (C) The organization manages information system authenticators by ensuring that authenticators have sufficient strength of mechanism for their intended use. (D) The organization manages information system authenticators by establishing and implementing administrative procedures for initial authenticator distribution, for lost/compromised or damaged authenticators, and for revoking authenticators. (E) The organization manages information system authenticators by changing the default content of authenticators prior to information system installation. (F) The organization manages information system authenticators by establishing minimum and maximum lifetime restrictions and reuse conditions for authenticators. (G) The organization manages information system authenticators by changing/refreshing authenticators [Assignment: organization-defined time period by authenticator type]. (H) The organization manages information system authenticators by protecting authenticator content from unauthorized disclosure and modification. (I) The organization manages information system authenticators by requiring individuals to take, and having devices implement, specific security safeguards to protect authenticators. (J) The organization manages information system authenticators by changing authenticators for group/role accounts when membership to those accounts changes.",
  "Extract of all organization-defined parameters (standardized format)": "(G) Time period by authenticator type",
  "Supplemental Guidance": "Individual authenticators include, for example, passwords, tokens, biometrics, Public Key Infrastructure (PKI) certificates, and key cards. Initial authenticator content is the actual content (e.g., the initial password) as opposed to requirements about authenticator content (e.g., minimum password length). In many cases, developers ship information system components with factory default authentication credentials to allow for initial installation and configuration. Default authentication credentials are often well known, easily discoverable, and present a significant security risk. The requirement to protect individual authenticators may be implemented via control PL-4 or PS-6 for authenticators in the possession of individuals and by controls AC-3, AC-6, and SC-28 for authenticators stored within organizational information systems (e.g., passwords stored in hashed or encrypted formats, files containing encrypted or hashed passwords accessible with administrator privileges). Information systems support individual authenticator management by organization-defined settings and restrictions for various authenticator characteristics including, for example, minimum password length, password composition, validation time window for time synchronous one-time tokens, and number of allowed rejections during the verification stage of biometric authentication. Specific actions that can be taken to safeguard authenticators include, for example, maintaining possession of individual authenticators, not loaning or sharing individual authenticators with others, and reporting lost, stolen, or compromised authenticators immediately. Authenticator management includes issuing and revoking, when no longer needed, authenticators for temporary access such as that required for remote maintenance. Device authenticators include, for example, certificates and passwords. Related controls: AC-2, AC-3, AC-6, CM-6, IA-2, IA-4, IA-8, PL-4, PS-5, PS-6, SC-12, SC-13, SC-17, SC-28",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-5(1)",
  "Name": "Authenticator Management",
  "Class": "Technical",
  "Title": "Authenticator Management | Password-Based Authentication",
  "Definition": "AUTHENTICATOR MANAGEMENT | PASSWORD-BASED AUTHENTICATION (a) The information system, for password-based authentication, enforces minimum password complexity of [Assignment: organization-defined requirements for case sensitivity, number of characters, mix of upper-case letters, lower-case letters, numbers, and special characters, including minimum requirements for each type]; (b) The information system, for password-based authentication, enforces at least the following number of changed characters when new passwords are created: [Assignment: organization-defined number]; (c) The information system, for password-based authentication, stores and transmits only cryptographically-protected passwords; (d) The information system, for password-based authentication, enforces password minimum and maximum lifetime restrictions of [Assignment: organization-defined numbers for lifetime minimum, lifetime maximum]; (e) The information system, for password-based authentication prohibits password reuse for [Assignment: organization-defined number] generations; and (f) The information system, for password-based authentication allows the use of a temporary password for system logons with an immediate change to a permanent password.",
  "Extract of all organization-defined parameters (standardized format)": "(a) Requirements for case sensitivity, number of characters, mix of upper-case letters, lower-case letters, numbers, and special characters, including minimum requirements for each type (b) Number (of changed characters when new passwords are created) (d) Numbers for lifetime minimum, lifetime maximum (e) Number (of generations of password re-use)",
  "Supplemental Guidance": "This control enhancement applies to single-factor authentication of individuals using passwords as individual or group authenticators, and in a similar manner, when passwords are part of multifactor authenticators. This control enhancement does not apply when passwords are used to unlock hardware authenticators (e.g., Personal Identity Verification cards). The implementation of such password mechanisms may not meet all of the requirements in the enhancement. Cryptographically-protected passwords include, for example, encrypted versions of passwords and one-way cryptographic hashes of passwords. The number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. Password lifetime restrictions do not apply to temporary passwords. To mitigate certain brute force attacks against passwords, organizations may also consider salting passwords. Related control: IA-6.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-5(6)",
  "Name": "Authenticator Management",
  "Class": "Technical",
  "Title": "Authenticator Management | Protection of Authenticators",
  "Definition": "AUTHENTICATOR MANAGEMENT | PROTECTION OF AUTHENTICATORS The organization protects authenticators commensurate with the security category of the information to which use of the authenticator permits access.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "For information systems containing multiple security categories of information without reliable physical or logical separation between categories, authenticators used to grant access to the systems are protected commensurate with the highest security category of information on the systems.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-5(7)",
  "Name": "Authenticator Management",
  "Class": "Technical",
  "Title": "Authenticator Management | No Embedded Unencrypted Static Authenticators",
  "Definition": "AUTHENTICATOR MANAGEMENT | NO EMBEDDED UNENCRYPTED STATIC AUTHENTICATORS The organization ensures that unencrypted static authenticators are not embedded in applications or access scripts or stored on function keys.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizations exercise caution in determining whether embedded or stored authenticators are in encrypted or unencrypted form. If authenticators are used in the manner stored, then those representations are considered unencrypted authenticators. This is irrespective of whether that representation is perhaps an encrypted version of something else (e.g., a password).",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-5(13)",
  "Name": "Authenticator Management",
  "Class": "Technical",
  "Title": "Authenticator Management | Expiration of Cached Authenticators",
  "Definition": "AUTHENTICATOR MANAGEMENT | EXPIRATION OF CACHED AUTHENTICATORS The information system prohibits the use of cached authenticators after [Assignment: organization-defined time period].",
  "Extract of all organization-defined parameters (standardized format)": "Time period",
  "Supplemental Guidance": "",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases. The organization must determine the maximum life of cached authenticators as part of tailoring this control.",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "IA-6",
  "Name": "Authenticator Feedback",
  "Class": "Technical",
  "Title": "Authenticator Feedback",
  "Definition": "(A) The information system obscures feedback of authentication information during the authentication process to protect the information from possible exploitation/use by unauthorized individuals.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "The feedback from information systems does not provide information that would allow unauthorized individuals to compromise authentication mechanisms. For some types of information systems or system components, for example, desktops/notebooks with relatively large monitors, the threat (often referred to as shoulder surfing) may be significant. For other types of systems or components, for example, mobile devices with 2-4 inch screens, this threat may be less significant, and may need to be balanced against the increased likelihood of typographic input errors due to the small keyboards. Therefore, the means for obscuring the authenticator feedback is selected accordingly. Obscuring the feedback of authentication information includes, for example, displaying asterisks when users type passwords into input devices, or displaying feedback for a very limited time before fully obscuring it. Related control: PE-18",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IA-8",
  "Name": "Identification and Authentication (Non-Organizational Users)",
  "Class": "Technical",
  "Title": "Identification and Authentication (Non-Organizational Users)",
  "Definition": "(A) The information system uniquely identifies and authenticates non-organizational users (or processes acting on behalf of non-organizational users).",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Non-organizational users include information system users other than organizational users explicitly covered by IA-2. These individuals are uniquely identified and authenticated for accesses other than those accesses explicitly identified and documented in AC-14. Authentication of non-organizational users accessing federal information systems may be required to protect federal, proprietary, or privacy-related information (with exceptions noted for national security systems). Organizations use risk assessments to determine authentication needs and consider scalability, practicality, and security in balancing the need to ensure ease of use for access to GC information and information systems with the need to protect and adequately mitigate risk. IA-2 addresses identification and authentication requirements for access to information systems by organizational users. Related controls: AC-2, AC-14, AC-17, AC-18, IA-2, IA-4, IA-5, MA-4, RA-3, SA-12, SC-8",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IR-4",
  "Name": "Incident Handling",
  "Class": "Operational",
  "Title": "Incident Handling",
  "Definition": "(A) The organization implements an incident handling capability for security incidents that includes preparation, detection and analysis, containment, eradication, and recovery. (B) The organization coordinates incident handling activities with contingency planning activities. (C) The organization incorporates lessons learned from ongoing incident handling activities into incident response procedures, training, and testing/exercises, and implements the resulting changes accordingly.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizations recognize that incident response capability is dependent on the capabilities of organizational information systems and the mission/business processes being supported by those systems. Therefore, organizations consider incident response as part of the definition, design, and development of mission/business processes and information systems. Incident-related information can be obtained from a variety of sources including, for example, audit monitoring, network monitoring, physical access monitoring, user/administrator reports, and reported supply chain events. Effective incident handling capability includes coordination among many organizational entities including, for example, mission/business owners, information system owners, authorizing officials, human resources offices, physical and personnel security offices, legal departments, operations personnel, procurement offices, and the risk executive (function). Related controls: AU-6, CM-6, CP-2, CP-4, IR-2, IR-3, IR-8, PE-6, SC-5, SC-7, SI-3, SI-4, SI-7",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IR-5",
  "Name": "Incident Monitoring",
  "Class": "Operational",
  "Title": "Incident Monitoring",
  "Definition": "(A) The organization tracks and documents information system security incidents.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Documenting information system security incidents includes, for example, maintaining records about each incident, the status of the incident, and other pertinent information necessary for forensics, evaluating incident details, trends, and handling. Incident information can be obtained from a variety of sources including, for example, incident reports, incident response teams, audit monitoring, network monitoring, physical access monitoring, and user/administrator reports. Related controls: AU-6, IR-8, PE-6, SC-5, SC-7, SI-3, SI-4, SI-7",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IR-6",
  "Name": "Incident Reporting",
  "Class": "Operational",
  "Title": "Incident Reporting",
  "Definition": "(A) The organization requires personnel to report suspected security incidents to the organizational incident response capability within [Assignment: organization-defined time period]. (B) The organization reports security incident information to [Assignment: organization-defined authorities].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Time period (B) Authorities",
  "Supplemental Guidance": "The intent of this control is to address both specific incident reporting requirements within an organization and the formal incident reporting requirements for GC departments or agencies and their subordinate organizations. Suspected security incidents include, for example, the receipt of suspicious email communications that can potentially contain malicious code. The types of security incidents reported, the content and timeliness of the reports, and the designated reporting authorities reflect applicable GC legislation and TBS policies, directives and standards. Related controls: IR-4, IR-5, IR-8",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "IR-8",
  "Name": "Incident Response Plan",
  "Class": "Operational",
  "Title": "Incident Response Plan",
  "Definition": "(A) The organization develops an incident response plan that: (a) Provides the organization with a roadmap for implementing its incident response capability; (b) Describes the structure and organization of the incident response capability; (c) Provides a high-level approach for how the incident response capability fits into the overall organization; (d) Meets the unique requirements of the organization, which relate to mission, size, structure, and functions; (e) Defines reportable incidents; (f) Provides metrics for measuring the incident response capability within the organization; (g) Defines the resources and management support needed to effectively maintain and mature an incident response capability; and (h) Is reviewed and approved by [Assignment: organization-defined personnel or roles]. (B) The organization distributes copies of the incident response plan to [Assignment: organization-defined incident response personnel (identified by name and/or by role) and organizational elements]. (C) The organization reviews the incident response plan [Assignment: organization-defined frequency]. (D) The organization updates the incident response plan to address system/organizational changes or problems encountered during plan implementation, execution, or testing. (E) The organization communicates incident response plan changes to [Assignment: organization-defined incident response personnel (identified by name and/or by role) and organizational elements]. (F) The organization protects the incident response plan from unauthorized disclosure and modification.",
  "Extract of all organization-defined parameters (standardized format)": "(A)(h) Personnel or roles (B) Incident response personnel (identified by name and/or by role) and organizational elements (C) Frequency (E) Incident response personnel (identified by name and/or by role) and organizational elements",
  "Supplemental Guidance": "It is important that organizations develop and implement a coordinated approach to incident response. Organizational missions, business functions, strategies, goals, and objectives for incident response help to determine the structure of incident response capabilities. As part of a comprehensive incident response capability, organizations consider the coordination and sharing of information with external organizations, including, for example, external service providers and organizations involved in the supply chain for organizational information systems. Related controls: MP-2, MP-4, MP-5",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "PL-7",
  "Name": "Security Concepts of Operation",
  "Class": "Management",
  "Title": "Security Concept of Operations",
  "Definition": "(A) The organization develops a security Concept of Operations (CONOPS) for the information system containing at a minimum, how the organization intends to operate the system from the perspective of information security. (B) The organization Reviews and updates the CONOPS [Assignment: organization-defined frequency].",
  "Extract of all organization-defined parameters (standardized format)": "(B) Frequency",
  "Supplemental Guidance": "The security CONOPS may be included in the security plan for the information system or in other system development life cycle-related documents, as appropriate. Changes to the CONOPS are reflected in ongoing updates to the security plan, the information security architecture, and other appropriate organizational documents (e.g., security specifications for procurements/acquisitions, system development life cycle documents and systems/security engineering documents). Related control: PL-2",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "RA-2",
  "Name": "Security Categorization",
  "Class": "Management",
  "Title": "Security Categorization",
  "Definition": "(A) The organization categorizes information and the information system in accordance with applicable GC legislation and TBS . (B) The organization documents the security categorization results (including supporting rationale) in the security plan for the information system. (C) The organization ensures that the security categorization decision is reviewed and approved by the authorizing official or authorizing official’s designated representative.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Clearly defined authorization boundaries are a prerequisite for effective security categorization decisions. Security categories describe the potential adverse impacts to organizational operations, organizational assets, and individuals if organizational information and information systems are compromised through a loss of confidentiality, integrity, or availability. Organizations conduct the security categorization process as an organization-wide activity with the involvement of chief information officers, senior information security officers, information system owners, mission/business owners, and information owners/stewards. Organizations also consider the potential adverse impacts to other organizations and, potential national-level adverse impacts. Security categorization processes carried out by organizations facilitate the development of inventories of information assets, and along with CM-8, mappings to specific information system components where information is processed, stored, or transmitted. Related controls: CM-8, MP-4, RA-3, SC-7",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "RA-3",
  "Name": "Risk Assessment",
  "Class": "Management",
  "Title": "Risk Assessment",
  "Definition": "(A) The organization conducts an assessment of risk, including the likelihood and magnitude of harm, from the unauthorized access, use, disclosure, disruption, modification, or destruction of the information system and the information it processes, stores, or transmits. (B) The organization documents risk assessment results in [Selection: security plan; risk assessment report; [Assignment: organization-defined document]]. (C) The organization reviews risk assessment results [Assignment: organization-defined frequency]. (D) The organization disseminates risk assessment results to [Assignment: organization-defined personnel or roles]. (E) The organization updates the risk assessment [Assignment: organization-defined frequency] or whenever there are significant changes to the information system or environment of operation (including the identification of new threats and vulnerabilities), or other conditions that may impact the security state of the system.",
  "Extract of all organization-defined parameters (standardized format)": "(B) Selection: security plan; risk assessment report; [Assignment: organization-defined document] (B) Document (if selected) (C) Frequency (D) Personnel or roles (E) Frequency",
  "Supplemental Guidance": "Clearly defined authorization boundaries are a prerequisite for effective risk assessments. Risk assessments take into account threats, vulnerabilities, likelihood, and impact to organizational operations and assets, individuals, other organizations, and Canada based on the operation and use of information systems. Risk assessments also take into account risk from external parties (e.g., service providers, contractors operating information systems on behalf of the organization, individuals accessing organizational information systems, outsourcing entities)Risk assessments (either formal or informal) can be conducted at all three tiers in the risk management hierarchy (i.e., organization level, mission/business process level, or information system level) and at any phase in the system development life cycle. Risk assessments can also be conducted at various steps in the Risk Management Framework of ITSG-33, including categorization, security control selection, security control implementation, security control assessment, information system authorization, and security control monitoring. RA-3 is noteworthy in that the control must be partially implemented prior to the implementation of other controls in order to complete the first two steps in the Risk Management Framework. Risk assessments can play an important role in security control selection processes, particularly during the application of tailoring guidance, which includes security control supplementation. Related controls: RA-2.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "RA-5",
  "Name": "Vulnerability Scanning",
  "Class": "Management",
  "Title": "Vulnerability Scanning",
  "Definition": "(A) The organization scans for vulnerabilities in the information system and hosted applications [Assignment: organization-defined frequency and/or randomly in accordance with organization-defined process] and when new vulnerabilities potentially affecting the system/applications are identified and reported. (B) The organization employs vulnerability scanning tools and techniques that facilitate interoperability among tools and automate parts of the vulnerability management process by using standards for: (a) Enumerating platforms, software flaws, and improper configurations; (b) Formatting checklists and test procedures; and (c) Measuring vulnerability impact. (C) The organization analyzes vulnerability scan reports and results from security control assessments. (D) The organization remediates legitimate vulnerabilities [Assignment: organization-defined response times] in accordance with an organizational assessment of risk. (E) The organization shares information obtained from the vulnerability scanning process and security control assessments with [Assignment: organization-defined personnel or roles] to help eliminate similar vulnerabilities in other information systems (i.e., systemic weaknesses or deficiencies).",
  "Extract of all organization-defined parameters (standardized format)": "(A) Frequency and/or randomly in accordance with organization-defined process (D) Response times (E) Personnel or roles",
  "Supplemental Guidance": "Security categorization of information systems guides the frequency and comprehensiveness of vulnerability scans. Organizations determine the required vulnerability scanning for all information system components, ensuring that potential sources of vulnerabilities such as networked printers, scanners, and copiers are not overlooked. Vulnerability analyses for custom software applications may require additional approaches such as static analysis, dynamic analysis, binary analysis, or a hybrid of the three approaches. Organizations can employ these analysis approaches in a variety of tools (e.g., web-based application scanners, static analysis tools, binary analyzers) and in source code reviews. Vulnerability scanning includes, for example: (i) scanning for patch levels; (ii) scanning for functions, ports, protocols, and services that should not be accessible to users or devices; and (iii) scanning for improperly configured or incorrectly operating information flow control mechanisms",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SA-8",
  "Name": "Security Engineering Principles",
  "Class": "Management",
  "Title": "Security Engineering Principles",
  "Definition": "(A) The organization applies information system security engineering principles in the specification, design, development, implementation, and modification of the information system.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Organizations apply security engineering principles primarily to new development information systems or systems undergoing major upgrades. For legacy systems, organizations apply security engineering principles to system upgrades and modifications to the extent feasible, given the current state of hardware, software, and firmware within those systems. Security engineering principles include, for example: (i) developing layered protections; (ii) establishing sound security policy, architecture, and controls as the foundation for design; (iii) incorporating security requirements into the system development life cycle; (iv) delineating physical and logical security boundaries; (v) ensuring that system developers are trained on how to build secure software; (vi) tailoring security controls to meet organizational and operational needs; (vii) performing threat modeling to identify use cases, threat agents, attack vectors, and attack patterns as well as compensating controls and design patterns needed to mitigate risk; and (viii) reducing risk to acceptable levels, thus enabling informed risk management decisions. Related controls: SA-3, SA-4, SA-17, SC-2, SC-3",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SA-11",
  "Name": "Developer Security Testing",
  "Class": "Management",
  "Title": "Developer Security Testing and Evaluation",
  "Definition": "(A) The organization requires the developer of the information system, system component, or information system service to create and implement a security assessment plan. (B) The organization requires the developer of the information system, system component, or information system service to perform [Selection (one or more): unit; integration; system; regression] testing/evaluation at [Assignment: organization-defined depth and coverage]. (C) The organization requires the developer of the information system, system component, or information system service to produce evidence of the execution of the security assessment plan and the results of the security testing/evaluation. (D) The organization requires the developer of the information system, system component, or information system service to implement a verifiable flaw remediation process. (E) The organization requires the developer of the information system, system component, or information system service to correct flaws identified during security testing/evaluation.",
  "Extract of all organization-defined parameters (standardized format)": "(B) Selection (one or more): unit; integration; system; regression (B) Depth and coverage",
  "Supplemental Guidance": "Developmental security testing/evaluation occurs at all post-design phases of the system development life cycle. Such testing/evaluation confirms that the required security controls are implemented correctly, operating as intended, enforcing the desired security policy, and meeting established security requirements. Security properties of information systems may be affected by the interconnection of system components or changes to those components. These interconnections or changes (e.g., upgrading or replacing applications and operating systems) may adversely affect previously implemented security controls. This control provides additional types of security testing/evaluation that developers can conduct to reduce or eliminate potential flaws. Testing custom software applications may require approaches such as static analysis, dynamic analysis, binary analysis, or a hybrid of the three approaches. Developers can employ these analysis approaches in a variety of tools (e.g., web-based application scanners, static analysis tools, binary analyzers) and in source code reviews. Security assessment plans provide the specific activities that developers plan to carry out including the types of analyses, testing, evaluation, and reviews of software and firmware components, the degree of rigour to be applied, and the types of artifacts produced during those processes. The depth of security testing/evaluation refers to the rigour and level of detail associated with the assessment process (e.g., black box, gray box, or white box testing). The coverage of security testing/evaluation refers to the scope (i.e., number and type) of the artifacts included in the assessment process. Contracts specify the acceptance criteria for security assessment plans, flaw remediation processes, and the evidence that the plans/processes have been diligently applied. Methods for reviewing and protecting assessment plans, evidence, and documentation are commensurate with the security category or classification level of the information system. Contracts may specify documentation protection requirements. Related controls: CA-2, CM-4, SA-3, SA-4, SA-5, SI-2",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SA-11(1)",
  "Name": "Developer Security Testing",
  "Class": "Management",
  "Title": "Developer Security Testing and Evaluation | Static Code Analysis",
  "Definition": "DEVELOPER SECURITY TESTING AND EVALUATION | STATIC CODE ANALYSIS The organization requires the developer of the information system, system component, or information system service to employ static code analysis tools to identify common flaws and document the results of the analysis.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Static code analysis provides a technology and methodology for security reviews. Such analysis can be used to identify security vulnerabilities and enforce security coding practices. Static code analysis is most effective when used early in the development process, when each code change can be automatically scanned for potential weaknesses. Static analysis can provide clear remediation guidance along with defects to enable developers to fix such defects. Evidence of correct implementation of static analysis can include, for example, aggregate defect density for critical defect types, evidence that defects were inspected by developers or security professionals, and evidence that defects were fixed. An excessively high density of ignored findings (commonly referred to as ignored or false positives) indicates a potential problem with the analysis process or tool. In such cases, organizations weigh the validity of the evidence against evidence from other sources.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "SA-11(4)",
  "Name": "Developer Security Testing",
  "Class": "Management",
  "Title": "Developer Security Testing and Evaluation | Manual Code Reviews",
  "Definition": "DEVELOPER SECURITY TESTING AND EVALUATION | MANUAL CODE REVIEWS The organization requires the developer of the information system, system component, or information system service to perform a manual code review of [Assignment: organization-defined specific code] using [Assignment: organization-defined processes, procedures, and/or techniques].",
  "Extract of all organization-defined parameters (standardized format)": "Specific code Processes, procedures, and/or techniques",
  "Supplemental Guidance": "Manual code reviews are usually reserved for the critical software and firmware components of information systems. Such code reviews are uniquely effective at identifying weaknesses that require knowledge of the application’s requirements or context which are generally unavailable to more automated analytic tools and techniques such as static or dynamic analysis. Components benefiting from manual review include for example, verifying access control matrices against application controls and reviewing more detailed aspects of cryptographic implementations and controls.",
  "General Tailoring and Implementation Guidance Notes": "Apply to boundary and other security critical components. For COTS products require 3rd party evaluation such as Common Criteria.",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SA-15",
  "Name": "Development Process, Standards, and Tool",
  "Class": "Management",
  "Title": "Development Process, Standards, and Tools",
  "Definition": "(A) The organization requires the developer of the information system, system component, or information system service to follow a documented development process that: (a) Explicitly addresses security requirements; (b) Identifies the standards and tools used in the development process; (c) Documents the specific tool options and tool configurations used in the development process; and (d) Documents, manages, and ensures the integrity of changes to the process and/or tools used in development. (B) The organization reviews the development process, standards, tools, and tool options/configurations [Assignment: organization-defined frequency] to determine if the process, standards, tools, and tool options/configurations selected and employed can satisfy [Assignment: organization-defined security requirements].",
  "Extract of all organization-defined parameters (standardized format)": "(B) Frequency (B) Security requirements",
  "Supplemental Guidance": "Development tools include, for example, programming languages and computer-aided design (CAD) systems. Reviews of development processes can include, for example, the use of maturity models to determine the potential effectiveness of such processes. Maintaining the integrity of changes to tools and processes enables accurate supply chain risk assessment and mitigation, and requires robust configuration control throughout the life cycle (including design, development, transport, delivery, integration, and maintenance) to track authorized changes and prevent unauthorized changes. Related controls: SA-3, SA-8.",
  "General Tailoring and Implementation Guidance Notes": "Apply to custom developed systems or components.",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SA-15(4)",
  "Name": "Development Process, Standards, and Tool",
  "Class": "Management",
  "Title": "Development Process, Standards, and Tools | Threat Modeling / Vulnerability Analysis",
  "Definition": "DEVELOPMENT PROCESS, STANDARDS, AND TOOLS | THREAT MODELING / VULNERABILITY ANALYSIS The organization requires that developers perform threat modeling and a vulnerability analysis for the information system at [Assignment: organization-defined breadth/depth] that: (a) Uses [Assignment: organization-defined information concerning impact, environment of operations, known or assumed threats, and acceptable risk levels]; (b) Employs [Assignment: organization-defined tools and methods]; and (c) Produces evidence that meets [Assignment: organization-defined acceptance criteria].",
  "Extract of all organization-defined parameters (standardized format)": "Breadth/depth (a) Information concerning impact, environment of operations, known or assumed threats, and acceptable risk levels (b) Tools and methods (c) Acceptance criteria",
  "Supplemental Guidance": "Related control: SA-4.",
  "General Tailoring and Implementation Guidance Notes": "Apply to custom developed systems or components.",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SA-16",
  "Name": "Developer Provided Training",
  "Class": "Management",
  "Title": "Developer-Provided Training",
  "Definition": "(A) The organization requires the developer of the information system, system component, or information system service to provide [Assignment: organization-defined training] on the correct use and operation of the implemented security functions, controls, and/or mechanisms.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Training",
  "Supplemental Guidance": "This control applies to external and internal (in-house) developers. Training of personnel is an essential element to ensure the effectiveness of security controls implemented within organizational information systems. Training options include, for example, classroom-style training, web-based/computer-based training, and hands-on training. Organizations can also request sufficient training materials from developers to conduct in-house training or offer self-training to organizational personnel. Organizations determine the type of training necessary and may require different types of training for different security functions, controls, or mechanisms. Related controls: AT-2, AT-3, SA-5",
  "General Tailoring and Implementation Guidance Notes": "Apply to custom developed systems or components.",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SA-22",
  "Name": "Unsupported System Components",
  "Class": "Management",
  "Title": "Unsupported System Components",
  "Definition": "(A) The organization replaces information system components when support for the components is no longer available from the developer, vendor, or manufacturer. (B) The organization provides justification and documents approval for the continued use of unsupported system components required to satisfy mission/business needs.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Support for information system components includes, for example, software patches, firmware updates, replacement parts, and maintenance contracts. Unsupported components (e.g., when vendors are no longer providing critical software patches), provide a substantial opportunity for adversaries to exploit new weaknesses discovered in the currently installed components. Exceptions to replacing unsupported system components may include, for example, systems that provide critical mission/business capability where newer technologies are not available or where the systems are so isolated that installing replacement components is not an option. Related controls: PL-2, SA-3",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SC-2",
  "Name": "Application Partitioning",
  "Class": "Technical",
  "Title": "Application Partitioning",
  "Definition": "(A) The information system separates user functionality (including user interface services) from information system management functionality.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Information system management functionality includes, for example, functions necessary to administer databases, network components, workstations, or servers, and typically requires privileged user access. The separation of user functionality from information system management functionality is either physical or logical. Organizations implement separation of system management-related functionality from user functionality by using different computers, different central processing units, different instances of operating systems, different network addresses, virtualization techniques, or combinations of these or other methods, as appropriate. This type of separation includes, for example, web administrative interfaces that use separate authentication methods (e.g., using a logical separation, web administrators would use 2-factor authentication and normal users of the web application would use username/password authentication). Separation of system and user functionality may include isolating administrative interfaces on different domains and with additional access controls. Related controls: SA-4, SA-8, SC-3",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-7",
  "Name": "Boundary Protection",
  "Class": "Technical",
  "Title": "Boundary Protection",
  "Definition": "(A) The information system monitors and controls communications at the external boundary of the system and at key internal boundaries within the system. (B) The information system implements sub-networks for publicly accessible system components that are [Selection: physically; logically] separated from internal organizational networks. (C) The information system connects to external networks or information systems only through managed interfaces consisting of boundary protection devices arranged in accordance with an organizational security architecture.",
  "Extract of all organization-defined parameters (standardized format)": "(B) Selection: physically; logically",
  "Supplemental Guidance": "Managed interfaces include, for example, gateways, routers, firewalls, guards, network-based malicious code analysis and virtualization systems, or encrypted tunnels implemented within a security architecture (e.g., routers protecting firewalls or application gateways residing on protected sub-networks). Sub-networks that are physically or logically separated from internal networks are referred to as demilitarized zones or DMZs. Restricting or prohibiting interfaces within organizational information systems includes, for example, restricting external web traffic to designated web servers within managed interfaces and prohibiting external traffic that appears to be spoofing internal addresses. Organizations consider the shared nature of commercial telecommunications services in the implementation of security controls associated with the use of such services. Commercial telecommunications services are commonly based on network components and consolidated management systems shared by all attached commercial customers, and may also include third party-provided access lines and other service elements. Such transmission services may represent sources of increased risk despite contract security provisions. Related controls: AC-4, AC-17, CA-3, CM-7, CP-8, IR-4, RA-3, SC-5, SC-13",
  "General Tailoring and Implementation Guidance Notes": "A Web Content Filtering proxy is a common device to monitor and control web traffic. Network-based intrusion detection or prevention system is another common device to monitor and control network traffic.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-7(5)",
  "Name": "Boundary Protection",
  "Class": "Technical",
  "Title": "Boundary Protection | Deny by Default / Allow by Exception",
  "Definition": "BOUNDARY PROTECTION | DENY BY DEFAULT / ALLOW BY EXCEPTION The information system at managed interfaces denies network communications traffic by default and allows network communications traffic by exception (i.e., deny all, permit by exception).",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "This control enhancement applies to both inbound and outbound network communications traffic. A deny-all, permit-by-exception network communications traffic policy ensures that only those connections which are essential and approved are allowed.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-8",
  "Name": "Transmission Confidentiality and Integrity",
  "Class": "Technical",
  "Title": "Transmission Confidentiality and Integrity",
  "Definition": "(A) The information system protects the [Selection (one or more): confidentiality; integrity] of transmitted information.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Selection (one or more): confidentiality; integrity",
  "Supplemental Guidance": "This control applies to both internal and external networks and all types of information system components from which information can be transmitted (e.g., servers, mobile devices, notebook computers, printers, copiers, scanners, facsimile machines). Communication paths outside the physical protection of a controlled boundary are exposed to the possibility of interception and modification. Protecting the confidentiality and/or integrity of organizational information can be accomplished by physical means (e.g., by employing protected distribution systems) or by logical means (e.g., employing encryption techniques). Organizations relying on commercial providers offering transmission services as commodity services rather than as fully dedicated services (i.e., services which can be highly specialized to individual customer needs), may find it difficult to obtain the necessary assurances regarding the implementation of needed security controls for transmission confidentiality/integrity. In such situations, organizations determine what types of confidentiality/integrity services are available in standard, commercial telecommunication service packages. If it is infeasible or impractical to obtain the necessary security controls and assurances of control effectiveness through appropriate contracting vehicles, organizations implement appropriate compensating security controls or explicitly accept the additional risk. Related controls: AC-17, PE-4",
  "General Tailoring and Implementation Guidance Notes": "TLS encryption between email servers is an example implementation of this control applied for emails exchange.",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SC-8(1)",
  "Name": "Transmission Confidentiality and Integrity",
  "Class": "Technical",
  "Title": "Transmission Confidentiality and Integrity | Cryptographic or Alternate Physical Protection",
  "Definition": "TRANSMISSION CONFIDENTIALITY AND INTEGRITY | CRYPTOGRAPHIC OR ALTERNATE PHYSICAL PROTECTION The information system implements cryptographic mechanisms to [Selection (one or more): prevent unauthorized disclosure of information; detect changes to information] during transmission unless otherwise protected by [Assignment: organization-defined alternative physical safeguards]. The cryptography must be compliant with the requirements of control SC-13.",
  "Extract of all organization-defined parameters (standardized format)": "Selection (one or more): prevent unauthorized disclosure of information; detect changes to information Alternative physical safeguards",
  "Supplemental Guidance": "Encrypting information for transmission protects information from unauthorized disclosure and modification. Cryptographic mechanisms implemented to protect information integrity include, for example, cryptographic hash functions which have common application in digital signatures, checksums, and message authentication codes. Alternative physical security safeguards include, for example, protected distribution systems. Related control: SC-13.",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement should be addressed where applicable and if practical to do so.",
  "ULL": true,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SC-12",
  "Name": "Cryptographic Key Establishment and Management",
  "Class": "Technical",
  "Title": "Cryptographic Key Establishment and Management",
  "Definition": "(A) The organization establishes and manages cryptographic keys for required cryptography employed within the information system in accordance with [Assignment: organization-defined requirements for key generation, distribution, storage, access, and destruction].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Requirements for key generation, distribution, storage, access, and destruction",
  "Supplemental Guidance": "Cryptographic key management and establishment can be performed using manual procedures or automated mechanisms with supporting manual procedures. Organizations define key management requirements in accordance with applicable GC legislation and TBS policies, directives, and standards, specifying appropriate options, levels, and parameters. Organizations manage trust stores to ensure that only approved trust anchors are in such trust stores. This includes certificates with visibility external to organizational information systems and certificates related to the internal operations of systems. The cryptography must be compliant with the requirements of control SC-13. Related controls: SC-13, SC-17",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-13",
  "Name": "Cryptographic Protection",
  "Class": "Technical",
  "Title": "Cryptographic Protection",
  "Definition": "(A) The information system implements [Assignment: organization-defined cryptographic uses and type of cryptography required for each use] in accordance with applicable GC legislation and TBS policies, directives and standards.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Cryptographic uses and type of cryptography required for each use",
  "Supplemental Guidance": "Cryptography can be employed to support a variety of security solutions including, for example, the protection of classified and Controlled Unclassified Information, the provision of digital signatures, and the enforcement of information separation when authorized individuals have the necessary clearances for such information but lack the necessary formal access approvals. Cryptography can also be used to support random number generation and hash generation. Generally applicable cryptographic standards include FIPS-validated cryptography and CSE-approved cryptography. This control does not impose any requirements on organizations to use cryptography. However, if cryptography is required based on the selection of other security controls or policies, organizations document each type of cryptographic use and the type of cryptography required (e.g., protection of classified information: CSE-approved cryptography; provision of digital signatures: FIPS-validated cryptography). Related controls: AC-2, AC-3, AC-7, AC-17, AC-18, AU-9, AU-10, CM-11, CP-9, IA-3, IA-7, MA-4, MP-2, MP-4, MP-5, SA-4, SC-8, SC-12, SC-28, SI-7",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-17",
  "Name": "Public Key Infrastructure Certificates",
  "Class": "Technical",
  "Title": "Public Key Infrastructure Certificates",
  "Definition": "(A) The organization issues public key certificates under an [Assignment: organization-defined certificate policy] or obtains public key certificates from an approved service provider.",
  "Extract of all organization-defined parameters (standardized format)": "(A) Certificate policy",
  "Supplemental Guidance": "For all certificates, organizations manage information system trust stores to ensure only approved trust anchors are in the trust stores. This control addresses both certificates with visibility external to organizational information systems and certificates related to the internal operations of systems, for example, application-specific time services. Related control: SC-12",
  "General Tailoring and Implementation Guidance Notes": "This security control ensures that public key certificates are issued from an appropriate GC Certification Authority.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-23",
  "Name": "Session Authenticity",
  "Class": "Technical",
  "Title": "Session Authenticity",
  "Definition": "(A) The information system protects the authenticity of communications sessions.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "This control addresses communications protection at the session, versus packet level (e.g., sessions in service-oriented architectures providing web-based services) and establishes grounds for confidence at both ends of communications sessions in ongoing identities of other parties and in the validity of information transmitted. Authenticity protection includes, for example, protecting against man-in-the-middle attacks/session hijacking and the insertion of false information into sessions. Related controls: SC-8, SC-10, SC-11",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-28",
  "Name": "Protection of Information At Rest",
  "Class": "Technical",
  "Title": "Protection of Information at Rest",
  "Definition": "(A) The information system protects the [Selection (one or more): confidentiality; integrity] of [Assignment: organization-defined information at rest].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Selection (one or more): confidentiality; integrity (A) Information at rest",
  "Supplemental Guidance": "This control addresses the confidentiality and integrity of information at rest and covers user information and system information. Information at rest refers to the state of information when it is located on storage devices as specific components of information systems. System-related information requiring protection includes, for example, configurations or rule sets for firewalls, gateways, intrusion detection/prevention systems, filtering routers, and authenticator content. Organizations may employ different mechanisms to achieve confidentiality and integrity protections, including the use of cryptographic mechanisms and file share scanning. Integrity protection can be achieved, for example, by implementing Write-Once-Read-Many (WORM) technologies. Organizations may also employ other security controls including, for example, secure off-line storage in lieu of online storage when adequate protection of information at rest cannot otherwise be achieved and/or continuous monitoring to identify malicious code at rest. Related controls: AC-3, AC-6, CA-7, CM-3, CM-5, CM-6, PE-3, SC-8, SC-13, SI-3, SI-7",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SC-28(1)",
  "Name": "Protection of Information At Rest",
  "Class": "Technical",
  "Title": "Protection of Information at Rest | Cryptographic Protection",
  "Definition": "PROTECTION OF INFORMATION AT REST | CRYPTOGRAPHIC PROTECTION The information system implements cryptographic mechanisms to prevent unauthorized disclosure and modification of [Assignment: organization-defined information] on [Assignment: organization-defined information system components].",
  "Extract of all organization-defined parameters (standardized format)": "Information Information system components",
  "Supplemental Guidance": "Selection of cryptographic mechanisms is based on the need to protect the confidentiality and integrity of organizational information. The strength of mechanism is commensurate with the security category and/or classification of the information. This control enhancement applies to significant concentrations of digital media in organizational areas designated for media storage and also to limited quantities of media generally associated with information system components in operational environments (e.g., portable storage devices, mobile devices). Organizations have the flexibility to either encrypt all information on storage devices (i.e., full disk encryption) or encrypt specific data structures (e.g., files, records, or fields). Organizations employing cryptographic mechanisms to protect information at rest also consider cryptographic key management solutions. Related controls: AC-19, SC-12.",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": false
},
{
  "ID": "SI-2",
  "Name": "Flaw Remediation",
  "Class": "Operational",
  "Title": "Flaw Remediation",
  "Definition": "(A) The organization identifies, reports, and corrects information system flaws. (B) The organization tests software and firmware updates related to flaw remediation for effectiveness and potential side effects before installation. (C) The organization installs security-relevant software and firmware updates within [Assignment: organization-defined time period] of the release of the updates. (D) The organization incorporates flaw remediation into the organizational configuration management process.",
  "Extract of all organization-defined parameters (standardized format)": "(C) Time period",
  "Supplemental Guidance": "Organizations identify information systems affected by announced software flaws including potential vulnerabilities resulting from those flaws, and report this information to designated organizational personnel with information security responsibilities. Security-relevant software updates include, for example, patches, service packs, hot fixes, and anti-virus signatures. Organizations also address flaws discovered during security assessments, continuous monitoring, incident response activities, and system error handling. Organizations take advantage of available resources such as the Common Weakness Enumeration (CWE) or Common Vulnerabilities and Exposures (CVE) databases in remediating flaws discovered in organizational information systems. By incorporating flaw remediation into ongoing configuration management processes, required/anticipated remediation actions can be tracked and verified. Flaw remediation actions that can be tracked and verified include, for example, determining whether organizations follow US-CERT guidance and Information Assurance Vulnerability Alerts. Organization-defined time periods for updating security-relevant software and firmware may vary based on a variety of factors including, for example, the security category of the information system or the criticality of the update (i.e., severity of the vulnerability related to the discovered flaw). Some types of flaw remediation may require more testing than other types. Organizations determine the degree and type of testing needed for the specific type of flaw remediation activity under consideration and also the types of changes that are to be configuration-managed. In some situations, organizations may determine that the testing of software and/or firmware updates is not necessary or practical, for example, when implementing simple anti-virus signature updates. Organizations may also consider in testing decisions, whether security-relevant software or firmware updates are obtained from authorized sources with appropriate digital signatures. Related controls: CA-2, CA-7, CM-3, CM-5, CM-8, MA-2, IR-4, RA-5, SA-10, SA-11, SI-11",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SI-4",
  "Name": "Information System Monitoring",
  "Class": "Operational",
  "Title": "Information System Monitoring",
  "Definition": "(A) The organization monitors the information system to detect: (a) Attacks and indicators of potential attacks in accordance with [Assignment: organization-defined monitoring objectives]; and (b) Unauthorized local, network, and remote connections; (B) The organization identifies unauthorized use of the information system through [Assignment: organization-defined techniques and methods]. (C) The organization deploys monitoring devices: (i) strategically within the information system to collect organization-determined essential information; and (ii) at ad hoc locations within the system to track specific types of transactions of interest to the organization. (D) The organization protects information obtained from intrusion-monitoring tools from unauthorized access, modification, and deletion. (E) The organization heightens the level of information system monitoring activity whenever there is an indication of increased risk to organizational operations and assets, individuals, other organizations, or Canada based on law enforcement information, intelligence information, or other credible sources of information. (F) The organization obtains legal opinion with regard to information system monitoring activities in accordance with GC legislation and TBS policies, directives and standards. (G) The organization provides [Assignment: organization-defined information system monitoring information] to [Assignment: organization-defined personnel or roles] [Selection (one or more): as needed; [Assignment: organization-defined frequency]].",
  "Extract of all organization-defined parameters (standardized format)": "(A)(a) Monitoring objectives (B) Techniques and methods (G) Information system monitoring information (G) Personnel or roles (G) Selection (one or more): as needed; [Assignment: organization-defined frequency] (G) Frequency (is selected)",
  "Supplemental Guidance": "Information system monitoring includes external and internal monitoring. External monitoring includes the observation of events occurring at the information system boundary (i.e., part of perimeter defence and boundary protection). Internal monitoring includes the observation of events occurring within the information system. Organizations can monitor information systems, for example, by observing audit activities in real time or by observing other system aspects such as access patterns, characteristics of access, and other actions. The monitoring objectives may guide determination of the events. Information system monitoring capability is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, scanning tools, audit record monitoring software, network monitoring software). Strategic locations for monitoring devices include, for example, selected perimeter locations and near server farms supporting critical applications, with such devices typically being employed at the managed interfaces associated with controls SC-7 and AC-17. The granularity of monitoring information collected is based on organizational monitoring objectives and the capability of information systems to support such objectives. Specific types of transactions of interest include, for example, HTTP traffic that bypasses HTTP proxies. Information system monitoring is an integral part of organizational continuous monitoring and incident response programs. Output from system monitoring serves as input to continuous monitoring and incident response programs. A network connection is any connection with a device that communicates through a network (e.g., local area network, Internet). A remote connection is any connection with a device communicating through an external network (e.g., the Internet). Local, network, and remote connections can be either wired or wireless. Related controls: AC-3, AC-4, AC-8, AC-17, AU-2, AU-6, AU-7, AU-9, AU-12, CA-7, IR-4, PE-3, RA-5, SC-7, SC-26, SC-35, SI-3, SI-7",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SI-10",
  "Name": "Information Input Validation",
  "Class": "Operational",
  "Title": "Information Input Validation",
  "Definition": "(A) The information system checks the validity of [Assignment: organization-defined information inputs].",
  "Extract of all organization-defined parameters (standardized format)": "(A) Information inputs",
  "Supplemental Guidance": "Checking the valid syntax and semantics of information system inputs (e.g., character set, length, numerical range, and acceptable values) verifies that inputs match specified definitions for format and content. Software applications typically follow well-defined protocols that use structured messages (i.e., commands or queries) to communicate between software modules or system components. Structured messages can contain raw or unstructured data interspersed with metadata or control information. If software applications use attacker-supplied inputs to construct structured messages without properly encoding such messages, then the attacker could insert malicious commands or special characters that can cause the data to be interpreted as control information or metadata. Consequently, the module or component that receives the tainted output will perform the wrong operations or otherwise interpret the data incorrectly. Pre-screening inputs prior to passing to interpreters prevents the content from being unintentionally interpreted as commands. Input validation helps to ensure accurate and correct inputs and prevent attacks such as cross-site scripting and a variety of injection attacks",
  "General Tailoring and Implementation Guidance Notes": "This security control/enhancement is considered to be best practice. Consequently, inclusion in a departmental profile is strongly encouraged in most cases.  This security control/enhancement should be addressed where applicable and if practical to do so.",
  "ULL": true,
  "PALL": true,
  "PBMM": true
},
{
  "ID": "SI-11",
  "Name": "Error Handling",
  "Class": "Operational",
  "Title": "Error Handling",
  "Definition": "(A) The information system generates error messages that provide information necessary for corrective actions without revealing information that could be exploited by adversaries. (B) The information system reveals error messages only to [Assignment: organization-defined personnel or roles].",
  "Extract of all organization-defined parameters (standardized format)": "(B) Personnel or roles",
  "Supplemental Guidance": "Organizations carefully consider the structure/content of error messages. The extent to which information systems are able to identify and handle error conditions is guided by organizational policy and operational requirements. Information that could be exploited by adversaries includes, for example, erroneous logon attempts with passwords entered by mistake as the username, mission/business information that can be derived from (if not stated explicitly by) information recorded, and personal information such as account numbers, social security numbers, and credit card numbers. In addition, error messages may provide a covert channel for transmitting information. Related controls: AU-2, AU-3, SC-31",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": false,
  "PALL": false,
  "PBMM": true
},
{
  "ID": "SI-12",
  "Name": "Information Output Handling and Retention",
  "Class": "Operational",
  "Title": "Information Handling and Retention",
  "Definition": "(A) The organization handles and retains information within the information system and information output from the system in accordance with applicable GC legislation and TBS policies, directives and standards.",
  "Extract of all organization-defined parameters (standardized format)": "None",
  "Supplemental Guidance": "Information handling and retention requirements cover the full life cycle of information, in some cases extending beyond the disposal of information systems. The National Library and Archives Canada provides guidance on records retention. Related controls: AC-16, AU-5, AU-11, MP-2, MP-4",
  "General Tailoring and Implementation Guidance Notes": "",
  "ULL": true,
  "PALL": true,
  "PBMM": true
}
]